OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * NXP Confidential. This software is owned or controlled by NXP and may only be
 * used strictly in accordance with the applicable license terms. By expressly
 * accepting such terms or by downloading, installing, activating and/or otherwise
 * using the software, you are agreeing that you have read, and that you agree to
 * comply with and are bound by, such license terms. If you do not agree to be
 * bound by the applicable license terms, then you may not retain, install,
 * activate or otherwise use the software. The production use license in
 * Section 2.3 is expressly granted for this software.
 */

/*!
 * @sbc_fs45_map.h
 *
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, Macro not referenced
 * Macros which are not currently referenced in code but can be used in the
 * future or by user.
 */

#ifndef SBC_FS45_MAP_H__
#define SBC_FS45_MAP_H__

/******************************************************************************/
/* INIT_VREG - Type: RW                                                       */
/******************************************************************************/

#define FS45_M_INIT_VREG_ADDR            0x01U
#define FS45_M_INIT_VREG_DEFAULT         0x45U

/**
 * Report a battery disconnection (POR of the main logic)
 */
#define FS45_R_M_BAT_FAIL_MASK           0x01U
/**
 * Configure VAUX regulator as a tracker of VCCA
 */
#define FS45_RW_M_VAUX_TRK_EN_MASK       0x02U
/**
 * Configure the current limitation duration before VAUX is switched off.
 */
#define FS45_RW_M_TAUX_LIM_OFF_MASK      0x04U
/**
 * CAN_5V overvoltage monitoring
 */
#define FS45_RW_M_VCAN_OV_MON_MASK       0x10U
/**
 * DISABLE the input power feed forward (IPFF) function of VPRE
 */
#define FS45_RW_M_IPFF_DIS_MASK          0x20U
/**
 * Configure the current limitation duration before VCCA is switched off. Only available for external PNP.
 */
#define FS45_RW_M_TCCA_LIM_OFF_MASK      0x40U
/**
 * Configure the current limitation threshold for VCCA. Only available for external PNP.
 */
#define FS45_RW_M_ICCA_LIM_MASK          0x80U

/**
 * Report a battery disconnection (POR of the main logic)
 */
#define FS45_R_M_BAT_FAIL_SHIFT          0x00U
/**
 * Configure VAUX regulator as a tracker of VCCA
 */
#define FS45_RW_M_VAUX_TRK_EN_SHIFT      0x01U
/**
 * Configure the current limitation duration before VAUX is switched off.
 */
#define FS45_RW_M_TAUX_LIM_OFF_SHIFT     0x02U
/**
 * CAN_5V overvoltage monitoring
 */
#define FS45_RW_M_VCAN_OV_MON_SHIFT      0x04U
/**
 * DISABLE the input power feed forward (IPFF) function of VPRE
 */
#define FS45_RW_M_IPFF_DIS_SHIFT         0x05U
/**
 * Configure the current limitation duration before VCCA is switched off. Only available for external PNP.
 */
#define FS45_RW_M_TCCA_LIM_OFF_SHIFT     0x06U
/**
 * Configure the current limitation threshold for VCCA. Only available for external PNP.
 */
#define FS45_RW_M_ICCA_LIM_SHIFT         0x07U

/**
 * NO POR
 */
#define FS45_R_M_BAT_FAIL_NO_POR         (0x00U << FS45_R_M_BAT_FAIL_SHIFT)
/**
 * POR occurred
 */
#define FS45_R_M_BAT_FAIL_POR            (0x01U << FS45_R_M_BAT_FAIL_SHIFT)

/**
 * NO tracking
 */
#define FS45_RW_M_VAUX_TRK_EN_NO_TRACKING (0x00U << FS45_RW_M_VAUX_TRK_EN_SHIFT)
/**
 * Tracking mode enabled and latched
 */
#define FS45_RW_M_VAUX_TRK_EN_TRACKING   (0x01U << FS45_RW_M_VAUX_TRK_EN_SHIFT)

/**
 * 10 ms
 */
#define FS45_RW_M_TAUX_LIM_OFF_10_MS     (0x00U << FS45_RW_M_TAUX_LIM_OFF_SHIFT)
/**
 * 50 ms
 */
#define FS45_RW_M_TAUX_LIM_OFF_50_MS     (0x01U << FS45_RW_M_TAUX_LIM_OFF_SHIFT)

/**
 * Off. VCAN OV is not monitored. Flag is ignored.
 */
#define FS45_RW_M_VCAN_OV_MON_OFF        (0x00U << FS45_RW_M_VCAN_OV_MON_SHIFT)
/**
 * On. VCAN OV is monitored. If OV the CAN_5V regulator is switched off.
 */
#define FS45_RW_M_VCAN_OV_MON_ON         (0x01U << FS45_RW_M_VCAN_OV_MON_SHIFT)

/**
 * Enabled
 */
#define FS45_RW_M_IPFF_DIS_ENABLED       (0x00U << FS45_RW_M_IPFF_DIS_SHIFT)
/**
 * Disabled
 */
#define FS45_RW_M_IPFF_DIS_DISABLED      (0x01U << FS45_RW_M_IPFF_DIS_SHIFT)

/**
 * 10 ms
 */
#define FS45_RW_M_TCCA_LIM_OFF_10_MS     (0x00U << FS45_RW_M_TCCA_LIM_OFF_SHIFT)
/**
 * 50 ms
 */
#define FS45_RW_M_TCCA_LIM_OFF_50_MS     (0x01U << FS45_RW_M_TCCA_LIM_OFF_SHIFT)

/**
 * ICCA_LIM_OUT
 */
#define FS45_RW_M_ICCA_LIM_ICCA_LIM_OUT  (0x00U << FS45_RW_M_ICCA_LIM_SHIFT)
/**
 * ICCA_LIM_INT
 */
#define FS45_RW_M_ICCA_LIM_ICCA_LIM_INT  (0x01U << FS45_RW_M_ICCA_LIM_SHIFT)

/******************************************************************************/
/* LONG_DURATION_TIMER - Type: RW                                             */
/******************************************************************************/

#define FS45_M_LONG_DURATION_TIMER_ADDR  0x06U
#define FS45_M_LONG_DURATION_TIMER_DEFAULT 0x04U

/**
 * Counter status
 */
#define FS45_R_M_LDT_INT_MASK            0x01U
/**
 * LDT counter control
 */
#define FS45_RW_M_LDT_ENABLE_MASK        0x02U
/**
 * Operating mode selection
 */
#define FS45_RW_M_MODE_MASK              0x04U
/**
 * Counter status
 */
#define FS45_R_M_LDT_RUNNING_MASK        0x08U
/**
 * Counter register selection
 */
#define FS45_RW_M_REG_SE_MASK            0x10U
/**
 * Select timer operating function
 */
#define FS45_RW_M_F2_F0_MASK             0xE0U

/**
 * Counter status
 */
#define FS45_R_M_LDT_INT_SHIFT           0x00U
/**
 * LDT counter control
 */
#define FS45_RW_M_LDT_ENABLE_SHIFT       0x01U
/**
 * Operating mode selection
 */
#define FS45_RW_M_MODE_SHIFT             0x02U
/**
 * Counter status
 */
#define FS45_R_M_LDT_RUNNING_SHIFT       0x03U
/**
 * Counter register selection
 */
#define FS45_RW_M_REG_SE_SHIFT           0x04U
/**
 * Select timer operating function
 */
#define FS45_RW_M_F2_F0_SHIFT            0x05U

/**
 * Counter not running
 */
#define FS45_R_M_LDT_INT_NOT_RUNNING     (0x00U << FS45_R_M_LDT_INT_SHIFT)
/**
 * Counter running
 */
#define FS45_R_M_LDT_INT_RUNNING         (0x01U << FS45_R_M_LDT_INT_SHIFT)

/**
 * LDT counter stop
 */
#define FS45_RW_M_LDT_ENABLE_STOP        (0x00U << FS45_RW_M_LDT_ENABLE_SHIFT)
/**
 * LDT counter start
 */
#define FS45_RW_M_LDT_ENABLE_START       (0x01U << FS45_RW_M_LDT_ENABLE_SHIFT)

/**
 * Calibration mode (488 us resolution)
 */
#define FS45_RW_M_MODE_CALIBRATION       (0x00U << FS45_RW_M_MODE_SHIFT)
/**
 * Normal mode (1 s resolution)
 */
#define FS45_RW_M_MODE_NORMAL            (0x01U << FS45_RW_M_MODE_SHIFT)

/**
 * Counter not running
 */
#define FS45_R_M_LDT_RUNNING_NOT_RUNNING (0x00U << FS45_R_M_LDT_RUNNING_SHIFT)
/**
 * Counter running
 */
#define FS45_R_M_LDT_RUNNING_RUNNING     (0x01U << FS45_R_M_LDT_RUNNING_SHIFT)

/**
 * Read programmed wake-up register
 */
#define FS45_RW_M_REG_SE_PROGRAMMED_REG  (0x00U << FS45_RW_M_REG_SE_SHIFT)
/**
 * Read real time counter into wake-up register (after counter is stopped with LDT_ENABLE bit)
 */
#define FS45_RW_M_REG_SE_RTC_REG         (0x01U << FS45_RW_M_REG_SE_SHIFT)

/**
 * In normal mode count and generate flag or INT when counter reaches the after run value
 */
#define FS45_RW_M_F2_F0_FUNCTION1        (0x00U << FS45_RW_M_F2_F0_SHIFT)
/**
 * In normal mode count until after run value is reached, then enters in LPOFF
 */
#define FS45_RW_M_F2_F0_FUNCTION2        (0x01U << FS45_RW_M_F2_F0_SHIFT)
/**
 * In normal mode count until after run value is reached, then enters in LPOFF. Once in LPOFF, count until wake-up 
 * value is reached and wake-up
 */
#define FS45_RW_M_F2_F0_FUNCTION3        (0x02U << FS45_RW_M_F2_F0_SHIFT)
/**
 * In LPOFF, count until wake-up value is reached and wake-up
 */
#define FS45_RW_M_F2_F0_FUNCTION4        (0x03U << FS45_RW_M_F2_F0_SHIFT)
/**
 * In LPOFF, count and do not wake-up. Counter value is stored in wake-up register
 */
#define FS45_RW_M_F2_F0_FUNCTION5        (0x04U << FS45_RW_M_F2_F0_SHIFT)

/******************************************************************************/
/* HW_CONFIG - Type: R                                                        */
/******************************************************************************/

#define FS45_M_HW_CONFIG_ADDR            0x08U
#define FS45_M_HW_CONFIG_DEFAULT         0x04U

/**
 * Report the configuration of the DEBUG mode
 */
#define FS45_R_M_DBG_HW_MASK             0x01U
/**
 * Report the deep fail-safe hardware configuration (main logic)
 */
#define FS45_R_M_DFS_HW1_MASK            0x02U
/**
 * Report the hardware configuration for VAUX
 */
#define FS45_R_M_VAUX_HW_MASK            0x08U
/**
 * Report the hardware configuration for VCCA
 */
#define FS45_R_M_VCCA_HW_MASK            0x10U
/**
 * Report the connection of an external PNP on VCCA
 */
#define FS45_R_M_VCCA_PNP_DET_MASK       0x20U
/**
 * Report the hardware configuration of VPRE
 */
#define FS45_R_M_LS_DETECT_MASK          0x80U

/**
 * Report the configuration of the DEBUG mode
 */
#define FS45_R_M_DBG_HW_SHIFT            0x00U
/**
 * Report the deep fail-safe hardware configuration (main logic)
 */
#define FS45_R_M_DFS_HW1_SHIFT           0x01U
/**
 * Report the hardware configuration for VAUX
 */
#define FS45_R_M_VAUX_HW_SHIFT           0x03U
/**
 * Report the hardware configuration for VCCA
 */
#define FS45_R_M_VCCA_HW_SHIFT           0x04U
/**
 * Report the connection of an external PNP on VCCA
 */
#define FS45_R_M_VCCA_PNP_DET_SHIFT      0x05U
/**
 * Report the hardware configuration of VPRE
 */
#define FS45_R_M_LS_DETECT_SHIFT         0x07U

/**
 * Normal operation
 */
#define FS45_R_M_DBG_HW_NORMAL           (0x00U << FS45_R_M_DBG_HW_SHIFT)
/**
 * Debug mode selected
 */
#define FS45_R_M_DBG_HW_DEBUG            (0x01U << FS45_R_M_DBG_HW_SHIFT)

/**
 * Deep fail-safe disable
 */
#define FS45_R_M_DFS_HW1_DISABLE         (0x00U << FS45_R_M_DFS_HW1_SHIFT)
/**
 * Deep fail-safe enable
 */
#define FS45_R_M_DFS_HW1_ENABLE          (0x01U << FS45_R_M_DFS_HW1_SHIFT)

/**
 * 5.0 V
 */
#define FS45_R_M_VAUX_HW_5_0V            (0x00U << FS45_R_M_VAUX_HW_SHIFT)
/**
 * 3.3 V
 */
#define FS45_R_M_VAUX_HW_3_3V            (0x01U << FS45_R_M_VAUX_HW_SHIFT)

/**
 * 3.3 V
 */
#define FS45_R_M_VCCA_HW_3_3V            (0x00U << FS45_R_M_VCCA_HW_SHIFT)
/**
 * 5.0 V
 */
#define FS45_R_M_VCCA_HW_5_0V            (0x01U << FS45_R_M_VCCA_HW_SHIFT)

/**
 * External PNP connected
 */
#define FS45_R_M_VCCA_PNP_DET_PNP_CONNECTED (0x00U << FS45_R_M_VCCA_PNP_DET_SHIFT)
/**
 * Internal MOSFET
 */
#define FS45_R_M_VCCA_PNP_DET_INT_MOSFET (0x01U << FS45_R_M_VCCA_PNP_DET_SHIFT)

/**
 * Buck-boost
 */
#define FS45_R_M_LS_DETECT_BUCK_BOOST    (0x00U << FS45_R_M_LS_DETECT_SHIFT)
/**
 * Buck only
 */
#define FS45_R_M_LS_DETECT_BUCK_ONLY     (0x01U << FS45_R_M_LS_DETECT_SHIFT)

/******************************************************************************/
/* WU_SOURCE - Type: R                                                        */
/******************************************************************************/

