OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_M_WU_SOURCE_ADDR            0x09U
#define FS45_M_WU_SOURCE_DEFAULT         0x00U

/**
 * Report a wake-up event from CAN or LIN
 */
#define FS45_R_M_PHY_WU_MASK             0x01U
/**
 * Report a wake-up event from long duration timer
 */
#define FS45_R_M_LDT_WU_MASK             0x02U
/**
 * Report an automatic wake-up event
 */
#define FS45_R_M_AUTO_WU_MASK            0x04U
/**
 * Report a wake-up event from IO_0
 */
#define FS45_R_M_IO_0_WU_MASK            0x08U
/**
 * Report a wake-up event from IO_2
 */
#define FS45_R_M_IO_2_WU_MASK            0x10U
/**
 * Report a wake-up event from IO_3
 */
#define FS45_R_M_IO_3_WU_MASK            0x20U
/**
 * Report a wake-up event from IO_4
 */
#define FS45_R_M_IO_4_WU_MASK            0x40U
/**
 * Report a wake-up event from IO_5
 */
#define FS45_R_M_IO_5_WU_MASK            0x80U

/**
 * Report a wake-up event from CAN or LIN
 */
#define FS45_R_M_PHY_WU_SHIFT            0x00U
/**
 * Report a wake-up event from long duration timer
 */
#define FS45_R_M_LDT_WU_SHIFT            0x01U
/**
 * Report an automatic wake-up event
 */
#define FS45_R_M_AUTO_WU_SHIFT           0x02U
/**
 * Report a wake-up event from IO_0
 */
#define FS45_R_M_IO_0_WU_SHIFT           0x03U
/**
 * Report a wake-up event from IO_2
 */
#define FS45_R_M_IO_2_WU_SHIFT           0x04U
/**
 * Report a wake-up event from IO_3
 */
#define FS45_R_M_IO_3_WU_SHIFT           0x05U
/**
 * Report a wake-up event from IO_4
 */
#define FS45_R_M_IO_4_WU_SHIFT           0x06U
/**
 * Report a wake-up event from IO_5
 */
#define FS45_R_M_IO_5_WU_SHIFT           0x07U

/**
 * No wake-up
 */
#define FS45_R_M_PHY_WU_NO_EVENT         (0x00U << FS45_R_M_PHY_WU_SHIFT)
/**
 * Wake-up event detected
 */
#define FS45_R_M_PHY_WU_EVENT            (0x01U << FS45_R_M_PHY_WU_SHIFT)

/**
 * No wake-up
 */
#define FS45_R_M_LDT_WU_NO_EVENT         (0x00U << FS45_R_M_LDT_WU_SHIFT)
/**
 * Wake-up event detected
 */
#define FS45_R_M_LDT_WU_EVENT            (0x01U << FS45_R_M_LDT_WU_SHIFT)

/**
 * No wake-up
 */
#define FS45_R_M_AUTO_WU_NO_EVENT        (0x00U << FS45_R_M_AUTO_WU_SHIFT)
/**
 * Wake-up event detected
 */
#define FS45_R_M_AUTO_WU_EVENT           (0x01U << FS45_R_M_AUTO_WU_SHIFT)

/**
 * No wake-up
 */
#define FS45_R_M_IO_0_WU_NO_EVENT        (0x00U << FS45_R_M_IO_0_WU_SHIFT)
/**
 * Wake-up event detected
 */
#define FS45_R_M_IO_0_WU_EVENT           (0x01U << FS45_R_M_IO_0_WU_SHIFT)

/**
 * No wake-up
 */
#define FS45_R_M_IO_2_WU_NO_EVENT        (0x00U << FS45_R_M_IO_2_WU_SHIFT)
/**
 * Wake-up event detected
 */
#define FS45_R_M_IO_2_WU_EVENT           (0x01U << FS45_R_M_IO_2_WU_SHIFT)

/**
 * No wake-up
 */
#define FS45_R_M_IO_3_WU_NO_EVENT        (0x00U << FS45_R_M_IO_3_WU_SHIFT)
/**
 * Wake-up event detected
 */
#define FS45_R_M_IO_3_WU_EVENT           (0x01U << FS45_R_M_IO_3_WU_SHIFT)

/**
 * No wake-up
 */
#define FS45_R_M_IO_4_WU_NO_EVENT        (0x00U << FS45_R_M_IO_4_WU_SHIFT)
/**
 * Wake-up event detected
 */
#define FS45_R_M_IO_4_WU_EVENT           (0x01U << FS45_R_M_IO_4_WU_SHIFT)

/**
 * No wake-up
 */
#define FS45_R_M_IO_5_WU_NO_EVENT        (0x00U << FS45_R_M_IO_5_WU_SHIFT)
/**
 * Wake-up event detected
 */
#define FS45_R_M_IO_5_WU_EVENT           (0x01U << FS45_R_M_IO_5_WU_SHIFT)

/******************************************************************************/
/* DEVICE_ID - Type: R                                                        */
/******************************************************************************/

#define FS45_M_DEVICE_ID_ADDR            0x0AU
#define FS45_M_DEVICE_ID_DEFAULT         0x00U

/**
 * Device silicon revision
 */
#define FS45_R_M_DEV_REV_MASK            0x07U
/**
 * VKAM supply
 */
#define FS45_R_M_VKAM_MASK               0x08U
/**
 * CAN or LIN physical layer
 */
#define FS45_R_M_PHY_MASK                0x30U
/**
 * VCORE current capability
 */
#define FS45_R_M_VCORE_MASK              0xC0U

/**
 * Device silicon revision
 */
#define FS45_R_M_DEV_REV_SHIFT           0x00U
/**
 * VKAM supply
 */
#define FS45_R_M_VKAM_SHIFT              0x03U
/**
 * CAN or LIN physical layer
 */
#define FS45_R_M_PHY_SHIFT               0x04U
/**
 * VCORE current capability
 */
#define FS45_R_M_VCORE_SHIFT             0x06U

/**
 * Silicon Rev. 000
 */
#define FS45_R_M_DEV_REV_REV_000         (0x00U << FS45_R_M_DEV_REV_SHIFT)
/**
 * Silicon Rev. 001
 */
#define FS45_R_M_DEV_REV_REV_001         (0x01U << FS45_R_M_DEV_REV_SHIFT)
/**
 * Silicon Rev. 010
 */
#define FS45_R_M_DEV_REV_REV_010         (0x02U << FS45_R_M_DEV_REV_SHIFT)
/**
 * Silicon Rev. 011
 */
#define FS45_R_M_DEV_REV_REV_011         (0x03U << FS45_R_M_DEV_REV_SHIFT)
/**
 * Silicon Rev. 100
 */
#define FS45_R_M_DEV_REV_REV_100         (0x04U << FS45_R_M_DEV_REV_SHIFT)
/**
 * Silicon Rev. 101
 */
#define FS45_R_M_DEV_REV_REV_101         (0x05U << FS45_R_M_DEV_REV_SHIFT)
/**
 * Silicon Rev. 110
 */
#define FS45_R_M_DEV_REV_REV_110         (0x06U << FS45_R_M_DEV_REV_SHIFT)
/**
 * Silicon Rev. 111
 */
#define FS45_R_M_DEV_REV_REV_111         (0x07U << FS45_R_M_DEV_REV_SHIFT)

/**
 * VKAM off by default
 */
#define FS45_R_M_VKAM_OFF                (0x00U << FS45_R_M_VKAM_SHIFT)
/**
 * VKAM on by default
 */
#define FS45_R_M_VKAM_ON                 (0x01U << FS45_R_M_VKAM_SHIFT)

/**
 * No CAN/no LIN
 */
#define FS45_R_M_PHY_NOCAN_NOLIN         (0x00U << FS45_R_M_PHY_SHIFT)
/**
 * CAN only
 */
#define FS45_R_M_PHY_CAN                 (0x01U << FS45_R_M_PHY_SHIFT)
/**
 * LIN only
 */
#define FS45_R_M_PHY_LIN                 (0x02U << FS45_R_M_PHY_SHIFT)
/**
 * CAN and LIN
 */
#define FS45_R_M_PHY_CAN_LIN             (0x03U << FS45_R_M_PHY_SHIFT)

/**
 * 1.5 A
 */
#define FS45_R_M_VCORE_1_5A              (0x00U << FS45_R_M_VCORE_SHIFT)
/**
 * 0.8 A
 */
#define FS45_R_M_VCORE_0_8A              (0x01U << FS45_R_M_VCORE_SHIFT)
/**
 * 0.5 A
 */
#define FS45_R_M_VCORE_0_5A              (0x02U << FS45_R_M_VCORE_SHIFT)
/**
 * 2.2 A
 */
#define FS45_R_M_VCORE_2_2A              (0x03U << FS45_R_M_VCORE_SHIFT)

/******************************************************************************/
/* IO_INPUT - Type: R                                                         */
/******************************************************************************/

#define FS45_M_IO_INPUT_ADDR             0x0BU
#define FS45_M_IO_INPUT_DEFAULT          0x00U

/**
 * Report IO_0 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_0_MASK               0x01U
/**
 * Report IO_2 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_2_MASK               0x08U
/**
 * Report IO_3 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_3_MASK               0x10U
/**
 * Report IO_4 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_4_MASK               0x40U
/**
 * Report IO_5 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_5_MASK               0x80U

/**
 * Report IO_0 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_0_SHIFT              0x00U
/**
 * Report IO_2 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_2_SHIFT              0x03U
/**
 * Report IO_3 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_3_SHIFT              0x04U
/**
 * Report IO_4 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_4_SHIFT              0x06U
/**
 * Report IO_5 digital state in normal mode. No update in LPOFF mode since wake-up features available
 */
#define FS45_R_M_IO_5_SHIFT              0x07U

/**
 * Low
 */
#define FS45_R_M_IO_0_LOW                (0x00U << FS45_R_M_IO_0_SHIFT)
/**
 * High
 */
#define FS45_R_M_IO_0_HIGH               (0x01U << FS45_R_M_IO_0_SHIFT)

/**
 * Low
 */
#define FS45_R_M_IO_2_LOW                (0x00U << FS45_R_M_IO_2_SHIFT)
/**
 * High
 */
#define FS45_R_M_IO_2_HIGH               (0x01U << FS45_R_M_IO_2_SHIFT)

/**
 * Low
 */
#define FS45_R_M_IO_3_LOW                (0x00U << FS45_R_M_IO_3_SHIFT)
/**
 * High
 */
#define FS45_R_M_IO_3_HIGH               (0x01U << FS45_R_M_IO_3_SHIFT)

/**
 * Low
 */
#define FS45_R_M_IO_4_LOW                (0x00U << FS45_R_M_IO_4_SHIFT)
/**
 * High
 */
#define FS45_R_M_IO_4_HIGH               (0x01U << FS45_R_M_IO_4_SHIFT)

/**
 * Low
 */
#define FS45_R_M_IO_5_LOW                (0x00U << FS45_R_M_IO_5_SHIFT)
/**
 * High
 */
#define FS45_R_M_IO_5_HIGH               (0x01U << FS45_R_M_IO_5_SHIFT)

/******************************************************************************/
/* DIAG_VPRE - Type: R                                                        */
/******************************************************************************/

