OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_M_DIAG_VPRE_ADDR            0x0CU
#define FS45_M_DIAG_VPRE_DEFAULT         0x44U

/**
 * Report a current limitation condition on VPRE
 */
#define FS45_R_M_ILIM_PRE_MASK           0x02U
/**
 * VPRE undervoltage detection
 */
#define FS45_R_M_VPRE_UV_MASK            0x04U
/**
 * VPRE overvoltage detection
 */
#define FS45_R_M_VPRE_OV_MASK            0x08U
/**
 * Thermal shutdown of VPRE
 */
#define FS45_R_M_TSD_PRE_MASK            0x10U
/**
 * Report a thermal warning from VPRE
 */
#define FS45_R_M_TWARN_PRE_MASK          0x20U
/**
 * Report the activation state of VPRE SMPS
 */
#define FS45_R_M_VPRE_STATE_MASK         0x40U
/**
 * Report a running mode of VPRE
 */
#define FS45_R_M_BOB_MASK                0x80U

/**
 * Report a current limitation condition on VPRE
 */
#define FS45_R_M_ILIM_PRE_SHIFT          0x01U
/**
 * VPRE undervoltage detection
 */
#define FS45_R_M_VPRE_UV_SHIFT           0x02U
/**
 * VPRE overvoltage detection
 */
#define FS45_R_M_VPRE_OV_SHIFT           0x03U
/**
 * Thermal shutdown of VPRE
 */
#define FS45_R_M_TSD_PRE_SHIFT           0x04U
/**
 * Report a thermal warning from VPRE
 */
#define FS45_R_M_TWARN_PRE_SHIFT         0x05U
/**
 * Report the activation state of VPRE SMPS
 */
#define FS45_R_M_VPRE_STATE_SHIFT        0x06U
/**
 * Report a running mode of VPRE
 */
#define FS45_R_M_BOB_SHIFT               0x07U

/**
 * No current limitation (IPRE_PK < IPRE_LIM)
 */
#define FS45_R_M_ILIM_PRE_NO_LIMITATION  (0x00U << FS45_R_M_ILIM_PRE_SHIFT)
/**
 * Current limitation (IPRE_PK > IPRE_LIM)
 */
#define FS45_R_M_ILIM_PRE_LIMITATION     (0x01U << FS45_R_M_ILIM_PRE_SHIFT)

/**
 * No undervoltage (VPRE > VPRE_UV)
 */
#define FS45_R_M_VPRE_UV_NO_UNDERVOLTAGE (0x00U << FS45_R_M_VPRE_UV_SHIFT)
/**
 * Undervoltage detected (VPRE < VPRE_UV)
 */
#define FS45_R_M_VPRE_UV_UNDERVOLTAGE    (0x01U << FS45_R_M_VPRE_UV_SHIFT)

/**
 * No overvoltage (VPRE < VPRE_OV)
 */
#define FS45_R_M_VPRE_OV_NO_OVERVOLTAGE  (0x00U << FS45_R_M_VPRE_OV_SHIFT)
/**
 * Overvoltage detected (VPRE > VPRE_OV)
 */
#define FS45_R_M_VPRE_OV_OVERVOLTAGE     (0x01U << FS45_R_M_VPRE_OV_SHIFT)

/**
 * No TSD (TJ < TSD_PRE)
 */
#define FS45_R_M_TSD_PRE_NO_TSD          (0x00U << FS45_R_M_TSD_PRE_SHIFT)
/**
 * TSD occurred (TJ > TSD_PRE)
 */
#define FS45_R_M_TSD_PRE_TSD_OCCURRED    (0x01U << FS45_R_M_TSD_PRE_SHIFT)

/**
 * No thermal warning (TJ < TWARN_PRE)
 */
#define FS45_R_M_TWARN_PRE_NO_WARNING    (0x00U << FS45_R_M_TWARN_PRE_SHIFT)
/**
 * Thermal warning (TJ > TWARN_PRE)
 */
#define FS45_R_M_TWARN_PRE_WARNING       (0x01U << FS45_R_M_TWARN_PRE_SHIFT)

/**
 * SMPS off
 */
#define FS45_R_M_VPRE_STATE_OFF          (0x00U << FS45_R_M_VPRE_STATE_SHIFT)
/**
 * SMPS on
 */
#define FS45_R_M_VPRE_STATE_ON           (0x01U << FS45_R_M_VPRE_STATE_SHIFT)

/**
 * Buck
 */
#define FS45_R_M_BOB_BUCK                (0x00U << FS45_R_M_BOB_SHIFT)
/**
 * Boost
 */
#define FS45_R_M_BOB_BOOST               (0x01U << FS45_R_M_BOB_SHIFT)

/******************************************************************************/
/* DIAG_VCORE - Type: R                                                       */
/******************************************************************************/

#define FS45_M_DIAG_VCORE_ADDR           0x0DU
#define FS45_M_DIAG_VCORE_DEFAULT        0x44U

/**
 * VCORE undervoltage detection
 */
#define FS45_R_M_VCORE_FB_UV_MASK        0x04U
/**
 * VCORE overvoltage detection
 */
#define FS45_R_M_VCORE_FB_OV_MASK        0x08U
/**
 * Thermal shutdown of VCORE
 */
#define FS45_R_M_TSD_CORE_MASK           0x10U
/**
 * Report a thermal warning from VCORE
 */
#define FS45_R_M_TWARN_CORE_MASK         0x20U
/**
 * Report the activation state of VCORE SMPS
 */
#define FS45_R_M_VCORE_STATE_MASK        0x40U

/**
 * VCORE undervoltage detection
 */
#define FS45_R_M_VCORE_FB_UV_SHIFT       0x02U
/**
 * VCORE overvoltage detection
 */
#define FS45_R_M_VCORE_FB_OV_SHIFT       0x03U
/**
 * Thermal shutdown of VCORE
 */
#define FS45_R_M_TSD_CORE_SHIFT          0x04U
/**
 * Report a thermal warning from VCORE
 */
#define FS45_R_M_TWARN_CORE_SHIFT        0x05U
/**
 * Report the activation state of VCORE SMPS
 */
#define FS45_R_M_VCORE_STATE_SHIFT       0x06U

/**
 * No undervoltage (VCORE_FB > VCORE_FB_UV)
 */
#define FS45_R_M_VCORE_FB_UV_NO_UNDERVOLTAGE (0x00U << FS45_R_M_VCORE_FB_UV_SHIFT)
/**
 * Undervoltage (VCORE_FB < VCORE_FB_UV)
 */
#define FS45_R_M_VCORE_FB_UV_UNDERVOLTAGE (0x01U << FS45_R_M_VCORE_FB_UV_SHIFT)

/**
 * No overvoltage (VCORE_FB < VCORE_FB_OV)
 */
#define FS45_R_M_VCORE_FB_OV_NO_OVERVOLTAGE (0x00U << FS45_R_M_VCORE_FB_OV_SHIFT)
/**
 * Overvoltage detected (VPRE > VPRE_OV)
 */
#define FS45_R_M_VCORE_FB_OV_OVERVOLTAGE (0x01U << FS45_R_M_VCORE_FB_OV_SHIFT)

/**
 * No TSD (TJ < TSD_PRE)
 */
#define FS45_R_M_TSD_CORE_NO_TSD         (0x00U << FS45_R_M_TSD_CORE_SHIFT)
/**
 * TSD occurred (TJ > TSD_CORE)
 */
#define FS45_R_M_TSD_CORE_TSD_OCCURRED   (0x01U << FS45_R_M_TSD_CORE_SHIFT)

/**
 * No thermal warning (TJ < TWARN_CORE)
 */
#define FS45_R_M_TWARN_CORE_NO_WARNING   (0x00U << FS45_R_M_TWARN_CORE_SHIFT)
/**
 * Thermal warning (TJ > TWARN_CORE)
 */
#define FS45_R_M_TWARN_CORE_WARNING      (0x01U << FS45_R_M_TWARN_CORE_SHIFT)

/**
 * SMPS off
 */
#define FS45_R_M_VCORE_STATE_OFF         (0x00U << FS45_R_M_VCORE_STATE_SHIFT)
/**
 * SMPS on
 */
#define FS45_R_M_VCORE_STATE_ON          (0x01U << FS45_R_M_VCORE_STATE_SHIFT)

/******************************************************************************/
/* DIAG_VCCA - Type: R                                                        */
/******************************************************************************/

#define FS45_M_DIAG_VCCA_ADDR            0x0EU
#define FS45_M_DIAG_VCCA_DEFAULT         0x04U

/**
 * Maximum current limitation duration. Available only when an external PNP is connected
 */
#define FS45_R_M_ILIM_CCA_OFF_MASK       0x01U
/**
 * Report a current limitation condition on VCCA
 */
#define FS45_R_M_ILIM_CCA_MASK           0x02U
/**
 * VCCA undervoltage detection
 */
#define FS45_R_M_VCCA_UV_MASK            0x04U
/**
 * VCCA overvoltage detection
 */
#define FS45_R_M_VCCA_OV_MASK            0x08U
/**
 * Thermal shutdown of VCCA
 */
#define FS45_R_M_TSD_CCA_MASK            0x10U
/**
 * Report a thermal warning from VCCA. Available only for internal pass MOSFET
 */
#define FS45_R_M_TWARN_CCA_MASK          0x20U

/**
 * Maximum current limitation duration. Available only when an external PNP is connected
 */
#define FS45_R_M_ILIM_CCA_OFF_SHIFT      0x00U
/**
 * Report a current limitation condition on VCCA
 */
#define FS45_R_M_ILIM_CCA_SHIFT          0x01U
/**
 * VCCA undervoltage detection
 */
#define FS45_R_M_VCCA_UV_SHIFT           0x02U
/**
 * VCCA overvoltage detection
 */
#define FS45_R_M_VCCA_OV_SHIFT           0x03U
/**
 * Thermal shutdown of VCCA
 */
#define FS45_R_M_TSD_CCA_SHIFT           0x04U
/**
 * Report a thermal warning from VCCA. Available only for internal pass MOSFET
 */
#define FS45_R_M_TWARN_CCA_SHIFT         0x05U

/**
 * T_LIMITATION < TCCA_LIM_OFF
 */
#define FS45_R_M_ILIM_CCA_OFF_NO_LIMITATION (0x00U << FS45_R_M_ILIM_CCA_OFF_SHIFT)
/**
 * T_LIMITATION > TCCA_LIM_OFF
 */
#define FS45_R_M_ILIM_CCA_OFF_LIMITATION (0x01U << FS45_R_M_ILIM_CCA_OFF_SHIFT)

/**
 * No current limitation (ICCA < ICCA_LIM)
 */
#define FS45_R_M_ILIM_CCA_NO_LIMITATION  (0x00U << FS45_R_M_ILIM_CCA_SHIFT)
/**
 * Current limitation (ICCA > ICCA_LIM)
 */
#define FS45_R_M_ILIM_CCA_LIMITATION     (0x01U << FS45_R_M_ILIM_CCA_SHIFT)

/**
 * No undervoltage (VCCA > VCCA_UV)
 */
#define FS45_R_M_VCCA_UV_NO_UNDERVOLTAGE (0x00U << FS45_R_M_VCCA_UV_SHIFT)
/**
 * Undervoltage detected (VCCA < VCCA_UV)
 */
#define FS45_R_M_VCCA_UV_UNDERVOLTAGE    (0x01U << FS45_R_M_VCCA_UV_SHIFT)

/**
 * No overvoltage (VCCA < VCCA_OV)
 */
#define FS45_R_M_VCCA_OV_NO_OVERVOLTAGE  (0x00U << FS45_R_M_VCCA_OV_SHIFT)
/**
 * Overvoltage detected (VCCA > VCCA_OV)
 */
#define FS45_R_M_VCCA_OV_OVERVOLTAGE     (0x01U << FS45_R_M_VCCA_OV_SHIFT)

/**
 * NO TSD (TJ < TSD_CCA)
 */
#define FS45_R_M_TSD_CCA_NO_TSD          (0x00U << FS45_R_M_TSD_CCA_SHIFT)
/**
 * TSD occurred (TJ > TSD_CCA)
 */
#define FS45_R_M_TSD_CCA_TSD_OCCURRED    (0x01U << FS45_R_M_TSD_CCA_SHIFT)

/**
 * No thermal warning (TJ < TWARN_CCA)
 */
#define FS45_R_M_TWARN_CCA_NO_WARNING    (0x00U << FS45_R_M_TWARN_CCA_SHIFT)
/**
 * Thermal warning (TJ > TWARN_CCA)
 */
#define FS45_R_M_TWARN_CCA_WARNING       (0x01U << FS45_R_M_TWARN_CCA_SHIFT)

/******************************************************************************/
/* DIAG_VAUX - Type: R                                                        */
/******************************************************************************/

#define FS45_M_DIAG_VAUX_ADDR            0x0FU
#define FS45_M_DIAG_VAUX_DEFAULT         0x04U

/**
 * Maximum current limitation duration
 */
#define FS45_R_M_ILIM_AUX_OFF_MASK       0x01U
/**
 * Report a current limitation condition on VAUX
 */
#define FS45_R_M_ILIM_AUX_MASK           0x02U
/**
 * VAUX undervoltage detection
 */
#define FS45_R_M_VAUX_UV_MASK            0x04U
/**
 * VAUX overvoltage detection
 */
#define FS45_R_M_VAUX_OV_MASK            0x08U
/**
 * Thermal shutdown of VAUX
 */
#define FS45_R_M_TSD_AUX_MASK            0x10U

/**
 * Maximum current limitation duration
 */
#define FS45_R_M_ILIM_AUX_OFF_SHIFT      0x00U
/**
 * Report a current limitation condition on VAUX
 */
#define FS45_R_M_ILIM_AUX_SHIFT          0x01U
/**
 * VAUX undervoltage detection
 */
#define FS45_R_M_VAUX_UV_SHIFT           0x02U
/**
 * VAUX overvoltage detection
 */
#define FS45_R_M_VAUX_OV_SHIFT           0x03U
/**
 * Thermal shutdown of VAUX
 */
#define FS45_R_M_TSD_AUX_SHIFT           0x04U

/**
 * T_LIMITATION < TAUX_LIM_OFF
 */
#define FS45_R_M_ILIM_AUX_OFF_NO_LIMITATION (0x00U << FS45_R_M_ILIM_AUX_OFF_SHIFT)
/**
 * T_LIMITATION > TAUX_LIM_OFF
 */
#define FS45_R_M_ILIM_AUX_OFF_LIMITATION (0x01U << FS45_R_M_ILIM_AUX_OFF_SHIFT)

/**
 * No current limitation (IAUX < IAUX_LIM)
 */
#define FS45_R_M_ILIM_AUX_NO_LIMITATION  (0x00U << FS45_R_M_ILIM_AUX_SHIFT)
/**
 * Current limitation (IAUX > IAUX_LIM)
 */
#define FS45_R_M_ILIM_AUX_LIMITATION     (0x01U << FS45_R_M_ILIM_AUX_SHIFT)

/**
 * No undervoltage (VAUX > VAUX_UV)
 */
#define FS45_R_M_VAUX_UV_NO_UNDERVOLTAGE (0x00U << FS45_R_M_VAUX_UV_SHIFT)
/**
 * Undervoltage detected (VAUX < VAUX_UV)
 */
#define FS45_R_M_VAUX_UV_UNDERVOLTAGE    (0x01U << FS45_R_M_VAUX_UV_SHIFT)

/**
 * No overvoltage (VAUX < VAUX_OV)
 */
#define FS45_R_M_VAUX_OV_NO_OVERVOLTAGE  (0x00U << FS45_R_M_VAUX_OV_SHIFT)
/**
 * Overvoltage detected (VAUX > VAUX_OV)
 */
#define FS45_R_M_VAUX_OV_OVERVOLTAGE     (0x01U << FS45_R_M_VAUX_OV_SHIFT)

/**
 * No TSD (TJ < TSD_AUX)
 */
#define FS45_R_M_TSD_AUX_NO_TSD          (0x00U << FS45_R_M_TSD_AUX_SHIFT)
/**
 * TSD occurred (TJ > TSD_AUX)
 */
#define FS45_R_M_TSD_AUX_TSD_OCCURRED    (0x01U << FS45_R_M_TSD_AUX_SHIFT)

/******************************************************************************/
/* DIAG_VSUP_VCAN - Type: R                                                   */
/******************************************************************************/

#define FS45_M_DIAG_VSUP_VCAN_ADDR       0x10U
#define FS45_M_DIAG_VSUP_VCAN_DEFAULT    0xC4U

/**
 * Report a current limitation condition on VCAN
 */
#define FS45_R_M_ILIM_CAN_MASK           0x02U
/**
 * VCAN undervoltage detection
 */
#define FS45_R_M_VCAN_UV_MASK            0x04U
/**
 * VCAN overvoltage detection
 */
#define FS45_R_M_VCAN_OV_MASK            0x08U
/**
 * Thermal shutdown of VCAN
 */
#define FS45_R_M_TSD_CAN_MASK            0x10U
/**
 * Input power feed forward (IPFF)
 */
#define FS45_R_M_IPFF_MASK               0x20U
/**
 * Detection of VSUP below VSUP_UV_7
 */
#define FS45_R_M_VSUP_UV_7_MASK          0x40U
/**
 * Detection of battery voltage below VSNS_UV
 */
#define FS45_R_M_VSNS_UV_MASK            0x80U

/**
 * Report a current limitation condition on VCAN
 */
#define FS45_R_M_ILIM_CAN_SHIFT          0x01U
/**
 * VCAN undervoltage detection
 */
#define FS45_R_M_VCAN_UV_SHIFT           0x02U
/**
 * VCAN overvoltage detection
 */
#define FS45_R_M_VCAN_OV_SHIFT           0x03U
/**
 * Thermal shutdown of VCAN
 */
#define FS45_R_M_TSD_CAN_SHIFT           0x04U
/**
 * Input power feed forward (IPFF)
 */
#define FS45_R_M_IPFF_SHIFT              0x05U
/**
 * Detection of VSUP below VSUP_UV_7
 */
#define FS45_R_M_VSUP_UV_7_SHIFT         0x06U
/**
 * Detection of battery voltage below VSNS_UV
 */
#define FS45_R_M_VSNS_UV_SHIFT           0x07U

/**
 * No current limitation (ICAN < ICAN_LIM)
 */
#define FS45_R_M_ILIM_CAN_NO_LIMITATION  (0x00U << FS45_R_M_ILIM_CAN_SHIFT)
/**
 * Current limitation (ICAN > ICAN _LIM)
 */
#define FS45_R_M_ILIM_CAN_LIMITATION     (0x01U << FS45_R_M_ILIM_CAN_SHIFT)

/**
 * No undervoltage (VCAN > VCAN_UV)
 */
#define FS45_R_M_VCAN_UV_NO_UNDERVOLTAGE (0x00U << FS45_R_M_VCAN_UV_SHIFT)
/**
 * Undervoltage detected (VCAN < VCAN_UV)
 */
#define FS45_R_M_VCAN_UV_UNDERVOLTAGE    (0x01U << FS45_R_M_VCAN_UV_SHIFT)

/**
 * No overvoltage (VCAN < VCAN_OV)
 */
#define FS45_R_M_VCAN_OV_NO_OVERVOLTAGE  (0x00U << FS45_R_M_VCAN_OV_SHIFT)
/**
 * Overvoltage detected (VCAN > VCAN_OV)
 */
#define FS45_R_M_VCAN_OV_OVERVOLTAGE     (0x01U << FS45_R_M_VCAN_OV_SHIFT)

/**
 * NO TSD (TJ < TSD_CAN)
 */
#define FS45_R_M_TSD_CAN_NO_TSD          (0x00U << FS45_R_M_TSD_CAN_SHIFT)
/**
 * TSD occurred (TJ > TSD_CAN)
 */
#define FS45_R_M_TSD_CAN_TSD_OCCURRED    (0x01U << FS45_R_M_TSD_CAN_SHIFT)

/**
 * Normal operation
 */
#define FS45_R_M_IPFF_NORMAL             (0x00U << FS45_R_M_IPFF_SHIFT)
/**
 * IPFF mode activated
 */
#define FS45_R_M_IPFF_IPFF               (0x01U << FS45_R_M_IPFF_SHIFT)

/**
 * VSUP > VSUP_UV_7
 */
#define FS45_R_M_VSUP_UV_7_VSUP_G        (0x00U << FS45_R_M_VSUP_UV_7_SHIFT)
/**
 * VSUP < VSUP_UV_7
 */
#define FS45_R_M_VSUP_UV_7_VSUP_L        (0x01U << FS45_R_M_VSUP_UV_7_SHIFT)

/**
 * VBAT > VSNS_UV
 */
#define FS45_R_M_VSNS_UV_VBAT_G          (0x00U << FS45_R_M_VSNS_UV_SHIFT)
/**
 * VBAT < VSNS_UV
 */
#define FS45_R_M_VSNS_UV_VBAT_L          (0x01U << FS45_R_M_VSNS_UV_SHIFT)

/******************************************************************************/
/* DIAG_CAN_FD - Type: R                                                      */
/******************************************************************************/

