OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_M_DIAG_CAN_FD_ADDR          0x11U
#define FS45_M_DIAG_CAN_FD_DEFAULT       0x00U

/**
 * TXD dominant clamping detection (short-circuit to GND)
 */
#define FS45_R_M_TXD_DOM_MASK            0x01U
/**
 * RXD recessive clamping detection (short-circuit to 5.0 V)
 */
#define FS45_R_M_RXD_REC_MASK            0x02U
/**
 * CAN Bus dominant clamping detection
 */
#define FS45_R_M_CAN_DOM_MASK            0x08U
/**
 * CANL short-circuit to GND detection
 */
#define FS45_R_M_CANL_GND_MASK           0x10U
/**
 * CANL short-circuit to battery detection
 */
#define FS45_R_M_CANL_BATT_MASK          0x20U
/**
 * CANH short-circuit to GND detection
 */
#define FS45_R_M_CANH_GND_MASK           0x40U
/**
 * CANH short-circuit to battery detection
 */
#define FS45_R_M_CANH_BATT_MASK          0x80U

/**
 * TXD dominant clamping detection (short-circuit to GND)
 */
#define FS45_R_M_TXD_DOM_SHIFT           0x00U
/**
 * RXD recessive clamping detection (short-circuit to 5.0 V)
 */
#define FS45_R_M_RXD_REC_SHIFT           0x01U
/**
 * CAN Bus dominant clamping detection
 */
#define FS45_R_M_CAN_DOM_SHIFT           0x03U
/**
 * CANL short-circuit to GND detection
 */
#define FS45_R_M_CANL_GND_SHIFT          0x04U
/**
 * CANL short-circuit to battery detection
 */
#define FS45_R_M_CANL_BATT_SHIFT         0x05U
/**
 * CANH short-circuit to GND detection
 */
#define FS45_R_M_CANH_GND_SHIFT          0x06U
/**
 * CANH short-circuit to battery detection
 */
#define FS45_R_M_CANH_BATT_SHIFT         0x07U

/**
 * No failure
 */
#define FS45_R_M_TXD_DOM_NO_FAILURE      (0x00U << FS45_R_M_TXD_DOM_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_TXD_DOM_FAILURE         (0x01U << FS45_R_M_TXD_DOM_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_RXD_REC_NO_FAILURE      (0x00U << FS45_R_M_RXD_REC_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_RXD_REC_FAILURE         (0x01U << FS45_R_M_RXD_REC_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_CAN_DOM_NO_FAILURE      (0x00U << FS45_R_M_CAN_DOM_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_CAN_DOM_FAILURE         (0x01U << FS45_R_M_CAN_DOM_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_CANL_GND_NO_FAILURE     (0x00U << FS45_R_M_CANL_GND_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_CANL_GND_FAILURE        (0x01U << FS45_R_M_CANL_GND_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_CANL_BATT_NO_FAILURE    (0x00U << FS45_R_M_CANL_BATT_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_CANL_BATT_FAILURE       (0x01U << FS45_R_M_CANL_BATT_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_CANH_GND_NO_FAILURE     (0x00U << FS45_R_M_CANH_GND_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_CANH_GND_FAILURE        (0x01U << FS45_R_M_CANH_GND_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_CANH_BATT_NO_FAILURE    (0x00U << FS45_R_M_CANH_BATT_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_CANH_BATT_FAILURE       (0x01U << FS45_R_M_CANH_BATT_SHIFT)

/******************************************************************************/
/* DIAG_CAN_LIN - Type: R                                                     */
/******************************************************************************/

#define FS45_M_DIAG_CAN_LIN_ADDR         0x12U
#define FS45_M_DIAG_CAN_LIN_DEFAULT      0x00U

/**
 * CAN overcurrent detection
 */
#define FS45_R_M_CAN_OC_MASK             0x01U
/**
 * CAN overtemperature detection
 */
#define FS45_R_M_CAN_OT_MASK             0x02U
/**
 * LIN overtemperature detection
 */
#define FS45_R_M_LIN_OT_MASK             0x08U
/**
 * LIN RXD recessive clamping detection (short-circuit to 5.0 V)
 */
#define FS45_R_M_RXDL_REC_MASK           0x10U
/**
 * LIN TXD dominant clamping detection (short-circuit to GND)
 */
#define FS45_R_M_TDXL_DOM_MASK           0x40U
/**
 * LIN bus dominant clamping detection
 */
#define FS45_R_M_LIN_DOM_MASK            0x80U

/**
 * CAN overcurrent detection
 */
#define FS45_R_M_CAN_OC_SHIFT            0x00U
/**
 * CAN overtemperature detection
 */
#define FS45_R_M_CAN_OT_SHIFT            0x01U
/**
 * LIN overtemperature detection
 */
#define FS45_R_M_LIN_OT_SHIFT            0x03U
/**
 * LIN RXD recessive clamping detection (short-circuit to 5.0 V)
 */
#define FS45_R_M_RXDL_REC_SHIFT          0x04U
/**
 * LIN TXD dominant clamping detection (short-circuit to GND)
 */
#define FS45_R_M_TDXL_DOM_SHIFT          0x06U
/**
 * LIN bus dominant clamping detection
 */
#define FS45_R_M_LIN_DOM_SHIFT           0x07U

/**
 * No failure
 */
#define FS45_R_M_CAN_OC_NO_FAILURE       (0x00U << FS45_R_M_CAN_OC_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_CAN_OC_FAILURE          (0x01U << FS45_R_M_CAN_OC_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_CAN_OT_NO_FAILURE       (0x00U << FS45_R_M_CAN_OT_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_CAN_OT_FAILURE          (0x01U << FS45_R_M_CAN_OT_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_LIN_OT_NO_FAILURE       (0x00U << FS45_R_M_LIN_OT_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_LIN_OT_FAILURE          (0x01U << FS45_R_M_LIN_OT_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_RXDL_REC_NO_FAILURE     (0x00U << FS45_R_M_RXDL_REC_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_RXDL_REC_FAILURE        (0x01U << FS45_R_M_RXDL_REC_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_TDXL_DOM_NO_FAILURE     (0x00U << FS45_R_M_TDXL_DOM_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_TDXL_DOM_FAILURE        (0x01U << FS45_R_M_TDXL_DOM_SHIFT)

/**
 * No failure
 */
#define FS45_R_M_LIN_DOM_NO_FAILURE      (0x00U << FS45_R_M_LIN_DOM_SHIFT)
/**
 * Failure detected
 */
#define FS45_R_M_LIN_DOM_FAILURE         (0x01U << FS45_R_M_LIN_DOM_SHIFT)

/******************************************************************************/
/* DIAG_SPI - Type: R                                                         */
/******************************************************************************/

#define FS45_M_DIAG_SPI_ADDR             0x13U
#define FS45_M_DIAG_SPI_DEFAULT          0x00U

/**
 * SPI parity bit error detection
 */
#define FS45_R_M_SPI_PARITY_MASK         0x02U
/**
 * Invalid SPI access (wrong write or read, write to INIT registers in normal mode, wrong address)
 */
#define FS45_R_M_SPI_REQ_MASK            0x08U
/**
 * SCLK error detection
 */
#define FS45_R_M_SPI_CLK_MASK            0x20U
/**
 * Secured SPI communication check
 */
#define FS45_R_M_SPI_ERR_MASK            0x80U

/**
 * SPI parity bit error detection
 */
#define FS45_R_M_SPI_PARITY_SHIFT        0x01U
/**
 * Invalid SPI access (wrong write or read, write to INIT registers in normal mode, wrong address)
 */
#define FS45_R_M_SPI_REQ_SHIFT           0x03U
/**
 * SCLK error detection
 */
#define FS45_R_M_SPI_CLK_SHIFT           0x05U
/**
 * Secured SPI communication check
 */
#define FS45_R_M_SPI_ERR_SHIFT           0x07U

/**
 * Parity bit ok
 */
#define FS45_R_M_SPI_PARITY_OK           (0x00U << FS45_R_M_SPI_PARITY_SHIFT)
/**
 * Parity bit error
 */
#define FS45_R_M_SPI_PARITY_ERROR        (0x01U << FS45_R_M_SPI_PARITY_SHIFT)

/**
 * No error
 */
#define FS45_R_M_SPI_REQ_NO_ERROR        (0x00U << FS45_R_M_SPI_REQ_SHIFT)
/**
 * SPI violation
 */
#define FS45_R_M_SPI_REQ_SPI_VIOLATION   (0x01U << FS45_R_M_SPI_REQ_SHIFT)

/**
 * 16 clock cycles during NCS low
 */
#define FS45_R_M_SPI_CLK_16_CLK_CYCLES   (0x00U << FS45_R_M_SPI_CLK_SHIFT)
/**
 * Wrong number of clock cycles (<16 or > 16)
 */
#define FS45_R_M_SPI_CLK_WRONG_NUMBER    (0x01U << FS45_R_M_SPI_CLK_SHIFT)

/**
 * No error
 */
#define FS45_R_M_SPI_ERR_NO_ERROR        (0x00U << FS45_R_M_SPI_ERR_SHIFT)
/**
 * Error detected in the secured bits
 */
#define FS45_R_M_SPI_ERR_ERROR           (0x01U << FS45_R_M_SPI_ERR_SHIFT)

/******************************************************************************/
/* MODE - Type: RW                                                            */
/******************************************************************************/

#define FS45_M_MODE_ADDR                 0x15U
#define FS45_M_MODE_DEFAULT              0x08U

/**
 * Report if the device resume from LPOFF-sleep or LPOFF_AUTO_WU mode
 */
#define FS45_R_M_LPOFF_MASK              0x01U
/**
 * Report if the device resume from deep fail-safe mode
 */
#define FS45_R_M_DFS_MASK                0x02U
/**
 * Report if normal mode of the main logic state machine is entered
 */
#define FS45_R_M_NORMAL_MASK             0x04U
/**
 * Report if INIT mode of the main logic state machine is entered
 */
#define FS45_R_M_INIT_MASK               0x08U
/**
 * Request for an INT pulse
 */
#define FS45_W_M_INT_REQ_MASK            0x10U
/**
 * Configure the device in LPOFF-SLEEP
 */
#define FS45_W_M_GO_LPOFF_MASK           0x20U
/**
 * Configure the device in LPOFF_AUTO_WU
 */
#define FS45_W_M_LPOFF_AUTO_WU_MASK      0x40U
/**
 * VKAM control (default state depends on part number)
 */
#define FS45_RW_M_VKAM_EN_MASK           0x80U

/**
 * Report if the device resume from LPOFF-sleep or LPOFF_AUTO_WU mode
 */
#define FS45_R_M_LPOFF_SHIFT             0x00U
/**
 * Report if the device resume from deep fail-safe mode
 */
#define FS45_R_M_DFS_SHIFT               0x01U
/**
 * Report if normal mode of the main logic state machine is entered
 */
#define FS45_R_M_NORMAL_SHIFT            0x02U
/**
 * Report if INIT mode of the main logic state machine is entered
 */
#define FS45_R_M_INIT_SHIFT              0x03U
/**
 * Request for an INT pulse
 */
#define FS45_W_M_INT_REQ_SHIFT           0x04U
/**
 * Configure the device in LPOFF-SLEEP
 */
#define FS45_W_M_GO_LPOFF_SHIFT          0x05U
/**
 * Configure the device in LPOFF_AUTO_WU
 */
#define FS45_W_M_LPOFF_AUTO_WU_SHIFT     0x06U
/**
 * VKAM control (default state depends on part number)
 */
#define FS45_RW_M_VKAM_EN_SHIFT          0x07U

/**
 * Not in LPOFF
 */
#define FS45_R_M_LPOFF_NOT_LPOFF         (0x00U << FS45_R_M_LPOFF_SHIFT)
/**
 * Resume from LPOFF
 */
#define FS45_R_M_LPOFF_RESUME_LPOFF      (0x01U << FS45_R_M_LPOFF_SHIFT)

/**
 * Not in deep fail-safe
 */
#define FS45_R_M_DFS_NOT_DFS             (0x00U << FS45_R_M_DFS_SHIFT)
/**
 * Resume from deep fail-safe
 */
#define FS45_R_M_DFS_RESUME_DFS          (0x01U << FS45_R_M_DFS_SHIFT)

/**
 * Not in normal mode
 */
#define FS45_R_M_NORMAL_NOT_NORMAL       (0x00U << FS45_R_M_NORMAL_SHIFT)
/**
 * Normal mode
 */
#define FS45_R_M_NORMAL_NORMAL           (0x01U << FS45_R_M_NORMAL_SHIFT)

/**
 * Not in INIT mode
 */
#define FS45_R_M_INIT_NOT_INIT           (0x00U << FS45_R_M_INIT_SHIFT)
/**
 * INIT mode
 */
#define FS45_R_M_INIT_INIT               (0x01U << FS45_R_M_INIT_SHIFT)

/**
 * No Request
 */
#define FS45_W_M_INT_REQ_NO              (0x00U << FS45_W_M_INT_REQ_SHIFT)
/**
 * Request for an INT pulse
 */
#define FS45_W_M_INT_REQ_INT_REQ         (0x01U << FS45_W_M_INT_REQ_SHIFT)

/**
 * No action
 */
#define FS45_W_M_GO_LPOFF_NO_ACTION      (0x00U << FS45_W_M_GO_LPOFF_SHIFT)
/**
 * Go to LPOFF mode and wait for wake-up event
 */
#define FS45_W_M_GO_LPOFF_LPOFF          (0x01U << FS45_W_M_GO_LPOFF_SHIFT)

/**
 * No action
 */
#define FS45_W_M_LPOFF_AUTO_WU_NO_ACTION (0x00U << FS45_W_M_LPOFF_AUTO_WU_SHIFT)
/**
 * Go to LPOFF mode and wake-up automatically after 1.0 ms
 */
#define FS45_W_M_LPOFF_AUTO_WU_LPOFF     (0x01U << FS45_W_M_LPOFF_AUTO_WU_SHIFT)

/**
 * DISABLED
 */
#define FS45_RW_M_VKAM_EN_DISABLED       (0x00U << FS45_RW_M_VKAM_EN_SHIFT)
/**
 * ENABLED
 */
#define FS45_RW_M_VKAM_EN_ENABLED        (0x01U << FS45_RW_M_VKAM_EN_SHIFT)

/******************************************************************************/
/* REG_MODE - Type: RW                                                        */
/******************************************************************************/

