OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_M_REG_MODE_ADDR             0x16U
#define FS45_M_REG_MODE_DEFAULT          0x0FU

/**
 * VCAN control
 */
#define FS45_R_M_VCAN_EN_MASK            0x01U
/**
 * VAUX control (switch off not recommended if VAUX is safety critical)
 */
#define FS45_R_M_VAUX_EN_MASK            0x02U
/**
 * VCCA control (switch off not recommended if VCCA is safety critical)
 */
#define FS45_R_M_VCCA_EN_MASK            0x04U
/**
 * VCORE control (switch off not recommended if VCORE is safety critical)
 */
#define FS45_R_M_VCORE_EN_MASK           0x08U
/**
 * VCAN control
 */
#define FS45_W_M_VCAN_EN_MASK            0x10U
/**
 * VAUX control (switch off not recommended if VAUX is safety critical)
 */
#define FS45_W_M_VAUX_EN_MASK            0x20U
/**
 * VCCA control (switch off not recommended if VCCA is safety critical)
 */
#define FS45_W_M_VCCA_EN_MASK            0x40U
/**
 * VCORE control (switch off not recommended if VCORE is safety critical)
 */
#define FS45_W_M_VCORE_EN_MASK           0x80U

/**
 * VCAN control
 */
#define FS45_R_M_VCAN_EN_SHIFT           0x00U
/**
 * VAUX control (switch off not recommended if VAUX is safety critical)
 */
#define FS45_R_M_VAUX_EN_SHIFT           0x01U
/**
 * VCCA control (switch off not recommended if VCCA is safety critical)
 */
#define FS45_R_M_VCCA_EN_SHIFT           0x02U
/**
 * VCORE control (switch off not recommended if VCORE is safety critical)
 */
#define FS45_R_M_VCORE_EN_SHIFT          0x03U
/**
 * VCAN control
 */
#define FS45_W_M_VCAN_EN_SHIFT           0x04U
/**
 * VAUX control (switch off not recommended if VAUX is safety critical)
 */
#define FS45_W_M_VAUX_EN_SHIFT           0x05U
/**
 * VCCA control (switch off not recommended if VCCA is safety critical)
 */
#define FS45_W_M_VCCA_EN_SHIFT           0x06U
/**
 * VCORE control (switch off not recommended if VCORE is safety critical)
 */
#define FS45_W_M_VCORE_EN_SHIFT          0x07U

/**
 * Disabled
 */
#define FS45_R_M_VCAN_EN_DISABLED        (0x00U << FS45_R_M_VCAN_EN_SHIFT)
/**
 * Enabled
 */
#define FS45_R_M_VCAN_EN_ENABLED         (0x01U << FS45_R_M_VCAN_EN_SHIFT)

/**
 * Disabled
 */
#define FS45_R_M_VAUX_EN_DISABLED        (0x00U << FS45_R_M_VAUX_EN_SHIFT)
/**
 * Enabled
 */
#define FS45_R_M_VAUX_EN_ENABLED         (0x01U << FS45_R_M_VAUX_EN_SHIFT)

/**
 * Disabled
 */
#define FS45_R_M_VCCA_EN_DISABLED        (0x00U << FS45_R_M_VCCA_EN_SHIFT)
/**
 * Enabled
 */
#define FS45_R_M_VCCA_EN_ENABLED         (0x01U << FS45_R_M_VCCA_EN_SHIFT)

/**
 * Disabled
 */
#define FS45_R_M_VCORE_EN_DISABLED       (0x00U << FS45_R_M_VCORE_EN_SHIFT)
/**
 * Enabled
 */
#define FS45_R_M_VCORE_EN_ENABLED        (0x01U << FS45_R_M_VCORE_EN_SHIFT)

/**
 * Disabled
 */
#define FS45_W_M_VCAN_EN_DISABLED        (0x00U << FS45_W_M_VCAN_EN_SHIFT)
/**
 * Enabled
 */
#define FS45_W_M_VCAN_EN_ENABLED         (0x01U << FS45_W_M_VCAN_EN_SHIFT)

/**
 * Disabled
 */
#define FS45_W_M_VAUX_EN_DISABLED        (0x00U << FS45_W_M_VAUX_EN_SHIFT)
/**
 * Enabled
 */
#define FS45_W_M_VAUX_EN_ENABLED         (0x01U << FS45_W_M_VAUX_EN_SHIFT)

/**
 * Disabled
 */
#define FS45_W_M_VCCA_EN_DISABLED        (0x00U << FS45_W_M_VCCA_EN_SHIFT)
/**
 * Enabled
 */
#define FS45_W_M_VCCA_EN_ENABLED         (0x01U << FS45_W_M_VCCA_EN_SHIFT)

/**
 * Disabled
 */
#define FS45_W_M_VCORE_EN_DISABLED       (0x00U << FS45_W_M_VCORE_EN_SHIFT)
/**
 * Enabled
 */
#define FS45_W_M_VCORE_EN_ENABLED        (0x01U << FS45_W_M_VCORE_EN_SHIFT)

/******************************************************************************/
/* IO_OUT_AMUX - Type: RW                                                     */
/******************************************************************************/

#define FS45_M_IO_OUT_AMUX_ADDR          0x17U
#define FS45_M_IO_OUT_AMUX_DEFAULT       0x00U

/**
 * Select AMUX output
 */
#define FS45_RW_M_AMUX_MASK              0x07U
/**
 * Configure IO_4 output gate driver state
 */
#define FS45_RW_M_IO_OUT_4_MASK          0x40U
/**
 * Enable the output gate driver capability for IO_4
 */
#define FS45_RW_M_IO_OUT_4_EN_MASK       0x80U

/**
 * Select AMUX output
 */
#define FS45_RW_M_AMUX_SHIFT             0x00U
/**
 * Configure IO_4 output gate driver state
 */
#define FS45_RW_M_IO_OUT_4_SHIFT         0x06U
/**
 * Enable the output gate driver capability for IO_4
 */
#define FS45_RW_M_IO_OUT_4_EN_SHIFT      0x07U

/**
 * VREF
 */
#define FS45_RW_M_AMUX_VREF              (0x00U << FS45_RW_M_AMUX_SHIFT)
/**
 * VSNS wide range
 */
#define FS45_RW_M_AMUX_VSNS_W            (0x01U << FS45_RW_M_AMUX_SHIFT)
/**
 * IO_0 wide range
 */
#define FS45_RW_M_AMUX_IO_0_W            (0x02U << FS45_RW_M_AMUX_SHIFT)
/**
 * IO_5 wide range
 */
#define FS45_RW_M_AMUX_IO_5_W            (0x03U << FS45_RW_M_AMUX_SHIFT)
/**
 * VSNS tight range
 */
#define FS45_RW_M_AMUX_VSNS_T            (0x04U << FS45_RW_M_AMUX_SHIFT)
/**
 * IO_0 tight range
 */
#define FS45_RW_M_AMUX_IO_0_T            (0x05U << FS45_RW_M_AMUX_SHIFT)
/**
 * IO_5 tight range/VKAM
 */
#define FS45_RW_M_AMUX_IO_5_T            (0x06U << FS45_RW_M_AMUX_SHIFT)
/**
 * Die Temperature Sensor
 */
#define FS45_RW_M_AMUX_TEMP_SENSOR       (0x07U << FS45_RW_M_AMUX_SHIFT)

/**
 * Low
 */
#define FS45_RW_M_IO_OUT_4_LOW           (0x00U << FS45_RW_M_IO_OUT_4_SHIFT)
/**
 * High
 */
#define FS45_RW_M_IO_OUT_4_HIGH          (0x01U << FS45_RW_M_IO_OUT_4_SHIFT)

/**
 * High-impedance (IO_4 configured as input)
 */
#define FS45_RW_M_IO_OUT_4_EN_Z          (0x00U << FS45_RW_M_IO_OUT_4_EN_SHIFT)
/**
 * Enabled (IO_4 configured as output gate driver)
 */
#define FS45_RW_M_IO_OUT_4_EN_ENABLED    (0x01U << FS45_RW_M_IO_OUT_4_EN_SHIFT)

/******************************************************************************/
/* CAN_LIN_MODE - Type: RW                                                    */
/******************************************************************************/

#define FS45_M_CAN_LIN_MODE_ADDR         0x18U
#define FS45_M_CAN_LIN_MODE_DEFAULT      0xB4U

/**
 * Report a wake-up event from the LIN
 */
#define FS45_R_M_LIN_WU_MASK             0x01U
/**
 * Report a wake-up event from the CAN
 */
#define FS45_R_M_CAN_WU_MASK             0x02U
/**
 * Automatic LIN mode disable
 */
#define FS45_RW_M_LIN_AUTO_DIS_MASK      0x04U
/**
 * Configure the LIN mode
 */
#define FS45_RW_M_LIN_MODE_MASK          0x18U
/**
 * Automatic CAN Tx disable
 */
#define FS45_RW_M_CAN_AUTO_DIS_MASK      0x20U
/**
 * Configure the CAN mode
 */
#define FS45_RW_M_CAN_MODE_MASK          0xC0U

/**
 * Report a wake-up event from the LIN
 */
#define FS45_R_M_LIN_WU_SHIFT            0x00U
/**
 * Report a wake-up event from the CAN
 */
#define FS45_R_M_CAN_WU_SHIFT            0x01U
/**
 * Automatic LIN mode disable
 */
#define FS45_RW_M_LIN_AUTO_DIS_SHIFT     0x02U
/**
 * Configure the LIN mode
 */
#define FS45_RW_M_LIN_MODE_SHIFT         0x03U
/**
 * Automatic CAN Tx disable
 */
#define FS45_RW_M_CAN_AUTO_DIS_SHIFT     0x05U
/**
 * Configure the CAN mode
 */
#define FS45_RW_M_CAN_MODE_SHIFT         0x06U

/**
 * No wake-up
 */
#define FS45_R_M_LIN_WU_NO_WU            (0x00U << FS45_R_M_LIN_WU_SHIFT)
/**
 * Wake-up detected
 */
#define FS45_R_M_LIN_WU_WU               (0x01U << FS45_R_M_LIN_WU_SHIFT)

/**
 * No wake-up
 */
#define FS45_R_M_CAN_WU_NO_WU            (0x00U << FS45_R_M_CAN_WU_SHIFT)
/**
 * Wake-up detected
 */
#define FS45_R_M_CAN_WU_WU               (0x01U << FS45_R_M_CAN_WU_SHIFT)

/**
 * No auto disable
 */
#define FS45_RW_M_LIN_AUTO_DIS_NO        (0x00U << FS45_RW_M_LIN_AUTO_DIS_SHIFT)
/**
 * Reset LIN_mode from 11 to 01 on LIN_OT or TXDL_DOM or RXDL_REC event
 */
#define FS45_RW_M_LIN_AUTO_DIS_RESET     (0x01U << FS45_RW_M_LIN_AUTO_DIS_SHIFT)

/**
 * Sleep/no wake-up capability
 */
#define FS45_RW_M_LIN_MODE_SLN_WU        (0x00U << FS45_RW_M_LIN_MODE_SHIFT)
/**
 * Listen only
 */
#define FS45_RW_M_LIN_MODE_LISTEN_ONLY   (0x01U << FS45_RW_M_LIN_MODE_SHIFT)
/**
 * Sleep/wake-up capability
 */
#define FS45_RW_M_LIN_MODE_SL_WU         (0x02U << FS45_RW_M_LIN_MODE_SHIFT)
/**
 * Normal operation mode
 */
#define FS45_RW_M_LIN_MODE_NORMAL        (0x03U << FS45_RW_M_LIN_MODE_SHIFT)

/**
 * NO auto disable
 */
#define FS45_RW_M_CAN_AUTO_DIS_NO        (0x00U << FS45_RW_M_CAN_AUTO_DIS_SHIFT)
/**
 * Reset CAN_mode from 11 to 01 on CAN_OT or TXD_DOM or RXD_REC event
 */
#define FS45_RW_M_CAN_AUTO_DIS_RESET     (0x01U << FS45_RW_M_CAN_AUTO_DIS_SHIFT)

/**
 * Sleep/no wake-up capability
 */
#define FS45_RW_M_CAN_MODE_SLN_WU        (0x00U << FS45_RW_M_CAN_MODE_SHIFT)
/**
 * Listen only
 */
#define FS45_RW_M_CAN_MODE_LISTEN_ONLY   (0x01U << FS45_RW_M_CAN_MODE_SHIFT)
/**
 * Sleep/wake-up capability
 */
#define FS45_RW_M_CAN_MODE_SL_WU         (0x02U << FS45_RW_M_CAN_MODE_SHIFT)
/**
 * Normal operation mode
 */
#define FS45_RW_M_CAN_MODE_NORMAL        (0x03U << FS45_RW_M_CAN_MODE_SHIFT)

/******************************************************************************/
/* LDT_AFTER_RUN_1 - Type: RW                                                 */
/******************************************************************************/

#define FS45_M_LDT_AFTER_RUN_1_ADDR      0x1AU
#define FS45_M_LDT_AFTER_RUN_1_DEFAULT   0x00U



/******************************************************************************/
/* LDT_AFTER_RUN_2 - Type: RW                                                 */
/******************************************************************************/

