OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_M_LDT_AFTER_RUN_2_ADDR      0x1BU
#define FS45_M_LDT_AFTER_RUN_2_DEFAULT   0x00U



/******************************************************************************/
/* LDT_WAKE_UP_1 - Type: RW                                                   */
/******************************************************************************/

#define FS45_M_LDT_WAKE_UP_1_ADDR        0x1CU
#define FS45_M_LDT_WAKE_UP_1_DEFAULT     0x00U



/******************************************************************************/
/* LDT_WAKE_UP_2 - Type: RW                                                   */
/******************************************************************************/

#define FS45_M_LDT_WAKE_UP_2_ADDR        0x1DU
#define FS45_M_LDT_WAKE_UP_2_DEFAULT     0x00U



/******************************************************************************/
/* LDT_WAKE_UP_3 - Type: RW                                                   */
/******************************************************************************/

#define FS45_M_LDT_WAKE_UP_3_ADDR        0x1EU
#define FS45_M_LDT_WAKE_UP_3_DEFAULT     0x00U



/******************************************************************************/
/* WD_ANSWER - Type: RW                                                       */
/******************************************************************************/

#define FS45_FS_WD_ANSWER_ADDR           0x29U
#define FS45_FS_WD_ANSWER_DEFAULT        0x40U

/**
 * Report an error from the EDC of the fail-safe state machine (error detection correction)
 */
#define FS45_R_FS_ERR_INT_SW_MASK        0x01U
/**
 * Report an error from an internal redundant structure of the fail-safe state machine
 */
#define FS45_R_FS_ERR_INT_HW_MASK        0x02U
/**
 * Report a watchdog timing refresh error
 */
#define FS45_R_FS_WD_BAD_TIMING_MASK     0x04U
/**
 * Report an IO monitoring error
 */
#define FS45_R_FS_IO_FS_G_MASK           0x08U
/**
 * Report a fail-safe output failure
 */
#define FS45_R_FS_FSO_G_MASK             0x10U
/**
 * Report a watchdog data refresh error
 */
#define FS45_R_FS_WD_BAD_DATA_MASK       0x20U
/**
 * Report a fail safe event
 */
#define FS45_R_FS_FSXB_MASK              0x40U
/**
 * Report a reset event
 */
#define FS45_R_FS_RSTB_MASK              0x80U
/**
 * WD answer from the MCU, Answer = (NOT(((LFSR x 4)+6)-4))/4
 */
#define FS45_W_FS_WD_ANSWER_MASK         0xFFU

/**
 * Report an error from the EDC of the fail-safe state machine (error detection correction)
 */
#define FS45_R_FS_ERR_INT_SW_SHIFT       0x00U
/**
 * WD answer from the MCU, Answer = (NOT(((LFSR x 4)+6)-4))/4
 */
#define FS45_W_FS_WD_ANSWER_SHIFT        0x00U
/**
 * Report an error from an internal redundant structure of the fail-safe state machine
 */
#define FS45_R_FS_ERR_INT_HW_SHIFT       0x01U
/**
 * Report a watchdog timing refresh error
 */
#define FS45_R_FS_WD_BAD_TIMING_SHIFT    0x02U
/**
 * Report an IO monitoring error
 */
#define FS45_R_FS_IO_FS_G_SHIFT          0x03U
/**
 * Report a fail-safe output failure
 */
#define FS45_R_FS_FSO_G_SHIFT            0x04U
/**
 * Report a watchdog data refresh error
 */
#define FS45_R_FS_WD_BAD_DATA_SHIFT      0x05U
/**
 * Report a fail safe event
 */
#define FS45_R_FS_FSXB_SHIFT             0x06U
/**
 * Report a reset event
 */
#define FS45_R_FS_RSTB_SHIFT             0x07U

/**
 * No error
 */
#define FS45_R_FS_ERR_INT_SW_NO_ERROR    (0x00U << FS45_R_FS_ERR_INT_SW_SHIFT)
/**
 * Error detected
 */
#define FS45_R_FS_ERR_INT_SW_ERROR       (0x01U << FS45_R_FS_ERR_INT_SW_SHIFT)

/**
 * No error
 */
#define FS45_R_FS_ERR_INT_HW_NO_ERROR    (0x00U << FS45_R_FS_ERR_INT_HW_SHIFT)
/**
 * Error detected
 */
#define FS45_R_FS_ERR_INT_HW_ERROR       (0x01U << FS45_R_FS_ERR_INT_HW_SHIFT)

/**
 * WD timing refresh OK
 */
#define FS45_R_FS_WD_BAD_TIMING_TIMING_OK (0x00U << FS45_R_FS_WD_BAD_TIMING_SHIFT)
/**
 * Wrong WD timing refresh
 */
#define FS45_R_FS_WD_BAD_TIMING_WRONG_TIMING (0x01U << FS45_R_FS_WD_BAD_TIMING_SHIFT)

/**
 * No error
 */
#define FS45_R_FS_IO_FS_G_NO_ERROR       (0x00U << FS45_R_FS_IO_FS_G_SHIFT)
/**
 * Error detected
 */
#define FS45_R_FS_IO_FS_G_ERROR          (0x01U << FS45_R_FS_IO_FS_G_SHIFT)

/**
 * No failure
 */
#define FS45_R_FS_FSO_G_NO_FAILURE       (0x00U << FS45_R_FS_FSO_G_SHIFT)
/**
 * Failure
 */
#define FS45_R_FS_FSO_G_FAILURE          (0x01U << FS45_R_FS_FSO_G_SHIFT)

/**
 * WD data refresh ok
 */
#define FS45_R_FS_WD_BAD_DATA_DATA_OK    (0x00U << FS45_R_FS_WD_BAD_DATA_SHIFT)
/**
 * Wrong WD data refresh
 */
#define FS45_R_FS_WD_BAD_DATA_WRONG_DATA (0x01U << FS45_R_FS_WD_BAD_DATA_SHIFT)

/**
 * No fail-safe
 */
#define FS45_R_FS_FSXB_NO_FS             (0x00U << FS45_R_FS_FSXB_SHIFT)
/**
 * Fail-safe event occurred (default state at power-up and after LPOFF as FS0B/FS1B are asserted low)
 */
#define FS45_R_FS_FSXB_FSE_OCCURRED      (0x01U << FS45_R_FS_FSXB_SHIFT)

/**
 * No reset
 */
#define FS45_R_FS_RSTB_NO_RESET          (0x00U << FS45_R_FS_RSTB_SHIFT)
/**
 * Reset occurred
 */
#define FS45_R_FS_RSTB_RESET_OCCURRED    (0x01U << FS45_R_FS_RSTB_SHIFT)

/******************************************************************************/
/* DIAG_SF_IOS - Type: R                                                      */
/******************************************************************************/

#define FS45_FS_DIAG_SF_IOS_ADDR         0x2DU
#define FS45_FS_DIAG_SF_IOS_DEFAULT      0x00U

/**
 * Report an error in the IO_45 protocol
 */
#define FS45_R_FS_IO_45_FAIL_MASK        0x01U
/**
 * Report an error in the FCCU protocol
 */
#define FS45_R_FS_IO_23_FAIL_MASK        0x02U
/**
 * Report a failure on FS1B
 */
#define FS45_R_FS_FS1B_DIAG_MASK         0x0CU
/**
 * Report a failure on FS0B
 */
#define FS45_R_FS_FS0B_DIAG_MASK         0x30U
/**
 * Report a RSTB short-circuit to high
 */
#define FS45_R_FS_RSTB_DIAG_MASK         0x40U
/**
 * Report an external RSTB
 */
#define FS45_R_FS_RSTB_EXT_MASK          0x80U

/**
 * Report an error in the IO_45 protocol
 */
#define FS45_R_FS_IO_45_FAIL_SHIFT       0x00U
/**
 * Report an error in the FCCU protocol
 */
#define FS45_R_FS_IO_23_FAIL_SHIFT       0x01U
/**
 * Report a failure on FS1B
 */
#define FS45_R_FS_FS1B_DIAG_SHIFT        0x02U
/**
 * Report a failure on FS0B
 */
#define FS45_R_FS_FS0B_DIAG_SHIFT        0x04U
/**
 * Report a RSTB short-circuit to high
 */
#define FS45_R_FS_RSTB_DIAG_SHIFT        0x06U
/**
 * Report an external RSTB
 */
#define FS45_R_FS_RSTB_EXT_SHIFT         0x07U

/**
 * No error
 */
#define FS45_R_FS_IO_45_FAIL_NO_ERROR    (0x00U << FS45_R_FS_IO_45_FAIL_SHIFT)
/**
 * Error detected
 */
#define FS45_R_FS_IO_45_FAIL_ERROR       (0x01U << FS45_R_FS_IO_45_FAIL_SHIFT)

/**
 * No error
 */
#define FS45_R_FS_IO_23_FAIL_NO_ERROR    (0x00U << FS45_R_FS_IO_23_FAIL_SHIFT)
/**
 * Error detected
 */
#define FS45_R_FS_IO_23_FAIL_ERROR       (0x01U << FS45_R_FS_IO_23_FAIL_SHIFT)

/**
 * No Failure
 */
#define FS45_R_FS_FS1B_DIAG_NO_FAILURE   (0x01U << FS45_R_FS_FS1B_DIAG_SHIFT)
/**
 * Short-circuit low/open load
 */
#define FS45_R_FS_FS1B_DIAG_SC_LOW       (0x02U << FS45_R_FS_FS1B_DIAG_SHIFT)
/**
 * Short-circuit high
 */
#define FS45_R_FS_FS1B_DIAG_SC_HIGH      (0x03U << FS45_R_FS_FS1B_DIAG_SHIFT)

/**
 * No Failure
 */
#define FS45_R_FS_FS0B_DIAG_NO_FAILURE   (0x01U << FS45_R_FS_FS0B_DIAG_SHIFT)
/**
 * Short-circuit low/open load
 */
#define FS45_R_FS_FS0B_DIAG_SC_LOW       (0x02U << FS45_R_FS_FS0B_DIAG_SHIFT)
/**
 * Short-circuit high
 */
#define FS45_R_FS_FS0B_DIAG_SC_HIGH      (0x03U << FS45_R_FS_FS0B_DIAG_SHIFT)

/**
 * No Failure
 */
#define FS45_R_FS_RSTB_DIAG_NO_FAILURE   (0x00U << FS45_R_FS_RSTB_DIAG_SHIFT)
/**
 * Short-circuit high
 */
#define FS45_R_FS_RSTB_DIAG_SC_HIGH      (0x01U << FS45_R_FS_RSTB_DIAG_SHIFT)

/**
 * No external RSTB
 */
#define FS45_R_FS_RSTB_EXT_NO            (0x00U << FS45_R_FS_RSTB_EXT_SHIFT)
/**
 * External RSTB
 */
#define FS45_R_FS_RSTB_EXT_EXTERNAL      (0x01U << FS45_R_FS_RSTB_EXT_SHIFT)

/******************************************************************************/
/* WD_COUNTER - Type: R                                                       */
/******************************************************************************/

