OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_FS_WD_COUNTER_ADDR          0x2EU
#define FS45_FS_WD_COUNTER_DEFAULT       0x00U

/**
 * Report the value of the watchdog refresh counter from 0 to 6 (7 generate a decrease of the FLT_ERR_CNT and this 
 * counter is reset to 0)
 */
#define FS45_R_FS_WD_RFR_MASK            0x0EU
/**
 * Report the value of the watchdog error counter from 0 to 5 (6 generate an increase of the FLT_ERR_CNT and this 
 * counter is reset to 0)
 */
#define FS45_R_FS_WD_ERR_MASK            0xE0U

/**
 * Report the value of the watchdog refresh counter from 0 to 6 (7 generate a decrease of the FLT_ERR_CNT and this 
 * counter is reset to 0)
 */
#define FS45_R_FS_WD_RFR_SHIFT           0x01U
/**
 * Report the value of the watchdog error counter from 0 to 5 (6 generate an increase of the FLT_ERR_CNT and this 
 * counter is reset to 0)
 */
#define FS45_R_FS_WD_ERR_SHIFT           0x05U

/******************************************************************************/
/* DIAG_SF_ERR - Type: R                                                      */
/******************************************************************************/

#define FS45_FS_DIAG_SF_ERR_ADDR         0x2FU
#define FS45_FS_DIAG_SF_ERR_DEFAULT      0x20U

/**
 * Report an undervoltage on FCRBM
 */
#define FS45_R_FS_FCRBM_UV_MASK          0x01U
/**
 * Report an overvoltage on FCRBM
 */
#define FS45_R_FS_FCRBM_OV_MASK          0x02U
/**
 * Report an overvoltage on V2P5 main digital regulator
 */
#define FS45_R_FS_V2P5_M_D_OV_MASK       0x04U
/**
 * Report an overvoltage on V2P5 main analog regulator
 */
#define FS45_R_FS_V2P5_M_A_OV_MASK       0x08U
/**
 * Report the value of the fault error counter
 */
#define FS45_R_FS_FLT_ERR_MASK           0xE0U

/**
 * Report an undervoltage on FCRBM
 */
#define FS45_R_FS_FCRBM_UV_SHIFT         0x00U
/**
 * Report an overvoltage on FCRBM
 */
#define FS45_R_FS_FCRBM_OV_SHIFT         0x01U
/**
 * Report an overvoltage on V2P5 main digital regulator
 */
#define FS45_R_FS_V2P5_M_D_OV_SHIFT      0x02U
/**
 * Report an overvoltage on V2P5 main analog regulator
 */
#define FS45_R_FS_V2P5_M_A_OV_SHIFT      0x03U
/**
 * Report the value of the fault error counter
 */
#define FS45_R_FS_FLT_ERR_SHIFT          0x05U

/**
 * No undervoltage (FB_Core - FCRBM > -150 mV)
 */
#define FS45_R_FS_FCRBM_UV_NO_UNDERVOLTAGE (0x00U << FS45_R_FS_FCRBM_UV_SHIFT)
/**
 * Undervoltage detected (FB_Core - FCRBM < -150 mV)
 */
#define FS45_R_FS_FCRBM_UV_UNDERVOLTAGE  (0x01U << FS45_R_FS_FCRBM_UV_SHIFT)

/**
 * No overvoltage (FB_Core - FCRBM < 150 mV)
 */
#define FS45_R_FS_FCRBM_OV_NO_OVERVOLTAGE (0x00U << FS45_R_FS_FCRBM_OV_SHIFT)
/**
 * Overvoltage detected (FB_Core - FCRBM > 150 mV)
 */
#define FS45_R_FS_FCRBM_OV_OVERVOLTAGE   (0x01U << FS45_R_FS_FCRBM_OV_SHIFT)

/**
 * No overvoltage (V2P5_M_D < V2P5_M_D_OV)
 */
#define FS45_R_FS_V2P5_M_D_OV_NO_OVERVOLTAGE (0x00U << FS45_R_FS_V2P5_M_D_OV_SHIFT)
/**
 * Overvoltage detected (V2P5_M_D > V2P5_M_D_OV)
 */
#define FS45_R_FS_V2P5_M_D_OV_OVERVOLTAGE (0x01U << FS45_R_FS_V2P5_M_D_OV_SHIFT)

/**
 * No overvoltage (V2P5_M_A < V2P5_M_A_OV)
 */
#define FS45_R_FS_V2P5_M_A_OV_NO_OVERVOLTAGE (0x00U << FS45_R_FS_V2P5_M_A_OV_SHIFT)
/**
 * Overvoltage detected (V2P5_M_A > V2P5_M_A_OV)
 */
#define FS45_R_FS_V2P5_M_A_OV_OVERVOLTAGE (0x01U << FS45_R_FS_V2P5_M_A_OV_SHIFT)

/******************************************************************************/
/* DEVICE_ID_FS - Type: R                                                     */
/******************************************************************************/

#define FS45_FS_DEVICE_ID_FS_ADDR        0x34U
#define FS45_FS_DEVICE_ID_FS_DEFAULT     0x00U

/**
 * Report the FS1B function availability (depends on part number)
 */
#define FS45_R_FS_FS1_MASK               0x01U
/**
 * Report the deep fail-safe hardware configuration (fail-safe logic)
 */
#define FS45_R_FS_DFS_HW2_MASK           0x02U

/**
 * Report the FS1B function availability (depends on part number)
 */
#define FS45_R_FS_FS1_SHIFT              0x00U
/**
 * Report the deep fail-safe hardware configuration (fail-safe logic)
 */
#define FS45_R_FS_DFS_HW2_SHIFT          0x01U

/**
 * Disabled
 */
#define FS45_R_FS_FS1_DISABLED           (0x00U << FS45_R_FS_FS1_SHIFT)
/**
 * Enabled
 */
#define FS45_R_FS_FS1_ENABLE             (0x01U << FS45_R_FS_FS1_SHIFT)

/**
 * Deep fail-safe disable
 */
#define FS45_R_FS_DFS_HW2_DISABLE        (0x00U << FS45_R_FS_DFS_HW2_SHIFT)
/**
 * Deep fail-safe enable
 */
#define FS45_R_FS_DFS_HW2_ENABLE         (0x01U << FS45_R_FS_DFS_HW2_SHIFT)

/******************************************************************************/
/* BIST - Type: RW                                                            */
/******************************************************************************/

#define FS45_FS_BIST_ADDR                0x22U
#define FS45_FS_BIST_DEFAULT             0x09U

/**
 * Diagnostic of analog BIST1 (automatically executed)
 */
#define FS45_R_FS_ABIST1_OK_MASK         0x01U
/**
 * Diagnostic of VAUX Analog BIST2 (executed on demand)
 */
#define FS45_R_FS_ABIST2_VAUX_OK_MASK    0x02U
/**
 * Diagnostic of FS1B Analog BIST2 (executed on demand)
 */
#define FS45_R_FS_ABIST2_FS1B_OK_MASK    0x04U
/**
 * Diagnostic of fail-safe logic BIST (automatically executed)
 */
#define FS45_R_FS_LBIST_OK_MASK          0x08U
/**
 * Request ABIST execution on VAUX
 */
#define FS45_W_FS_ABIST2_VAUX_MASK       0x20U
/**
 * Request ABIST execution on FS1B
 */
#define FS45_W_FS_ABIST2_FS1B_MASK       0x40U

/**
 * Diagnostic of analog BIST1 (automatically executed)
 */
#define FS45_R_FS_ABIST1_OK_SHIFT        0x00U
/**
 * Diagnostic of VAUX Analog BIST2 (executed on demand)
 */
#define FS45_R_FS_ABIST2_VAUX_OK_SHIFT   0x01U
/**
 * Diagnostic of FS1B Analog BIST2 (executed on demand)
 */
#define FS45_R_FS_ABIST2_FS1B_OK_SHIFT   0x02U
/**
 * Diagnostic of fail-safe logic BIST (automatically executed)
 */
#define FS45_R_FS_LBIST_OK_SHIFT         0x03U
/**
 * Request ABIST execution on VAUX
 */
#define FS45_W_FS_ABIST2_VAUX_SHIFT      0x05U
/**
 * Request ABIST execution on FS1B
 */
#define FS45_W_FS_ABIST2_FS1B_SHIFT      0x06U

/**
 * ABIST1 fail
 */
#define FS45_R_FS_ABIST1_OK_FAIL         (0x00U << FS45_R_FS_ABIST1_OK_SHIFT)
/**
 * ABIST1 pass
 */
#define FS45_R_FS_ABIST1_OK_PASS         (0x01U << FS45_R_FS_ABIST1_OK_SHIFT)

/**
 * VAUX ABIST fail or not executed
 */
#define FS45_R_FS_ABIST2_VAUX_OK_FAIL    (0x00U << FS45_R_FS_ABIST2_VAUX_OK_SHIFT)
/**
 * VAUX ABIST pass
 */
#define FS45_R_FS_ABIST2_VAUX_OK_PASS    (0x01U << FS45_R_FS_ABIST2_VAUX_OK_SHIFT)

/**
 * FS1B ABIST fail or not executed
 */
#define FS45_R_FS_ABIST2_FS1B_OK_FAIL    (0x00U << FS45_R_FS_ABIST2_FS1B_OK_SHIFT)
/**
 * FS1B ABIST pass
 */
#define FS45_R_FS_ABIST2_FS1B_OK_PASS    (0x01U << FS45_R_FS_ABIST2_FS1B_OK_SHIFT)

/**
 * LBIST fail
 */
#define FS45_R_FS_LBIST_OK_FAIL          (0x00U << FS45_R_FS_LBIST_OK_SHIFT)
/**
 * LBIST pass
 */
#define FS45_R_FS_LBIST_OK_PASS          (0x01U << FS45_R_FS_LBIST_OK_SHIFT)

/**
 * No action
 */
#define FS45_W_FS_ABIST2_VAUX_NO_ACTION  (0x00U << FS45_W_FS_ABIST2_VAUX_SHIFT)
/**
 * Launch ABIST on VAUX
 */
#define FS45_W_FS_ABIST2_VAUX_ABIST_VAUX (0x01U << FS45_W_FS_ABIST2_VAUX_SHIFT)

/**
 * No action
 */
#define FS45_W_FS_ABIST2_FS1B_NO_ACTION  (0x00U << FS45_W_FS_ABIST2_FS1B_SHIFT)
/**
 * Launch ABIST on FS1B
 */
#define FS45_W_FS_ABIST2_FS1B_ABIST_FS1B (0x01U << FS45_W_FS_ABIST2_FS1B_SHIFT)

/******************************************************************************/
/* RELEASE_FSXB - Type: RW                                                    */
/******************************************************************************/

#define FS45_FS_RELEASE_FSXB_ADDR        0x2AU
#define FS45_FS_RELEASE_FSXB_DEFAULT     0x01U

/**
 * Sense of RSTB pad
 */
#define FS45_R_FS_RSTB_SNS_MASK          0x01U
/**
 * Sense of FS0B pad
 */
#define FS45_R_FS_FS0B_SNS_MASK          0x02U
/**
 * Sense of FS1B pad
 */
#define FS45_R_FS_FS1B_SNS_MASK          0x04U
/**
 * Secured 8 bits word to release the FS0B and FS1B pins, depend on LFSR_out value and calculation
 */
#define FS45_W_FS_RELEASE_FSXB_MASK      0xFFU

/**
 * Sense of RSTB pad
 */
#define FS45_R_FS_RSTB_SNS_SHIFT         0x00U
/**
 * Secured 8 bits word to release the FS0B and FS1B pins, depend on LFSR_out value and calculation
 */
#define FS45_W_FS_RELEASE_FSXB_SHIFT     0x00U
/**
 * Sense of FS0B pad
 */
#define FS45_R_FS_FS0B_SNS_SHIFT         0x01U
/**
 * Sense of FS1B pad
 */
#define FS45_R_FS_FS1B_SNS_SHIFT         0x02U

/**
 * RSTB pad sense low
 */
#define FS45_R_FS_RSTB_SNS_LOW           (0x00U << FS45_R_FS_RSTB_SNS_SHIFT)
/**
 * RSTB pad sense high
 */
#define FS45_R_FS_RSTB_SNS_HIGH          (0x01U << FS45_R_FS_RSTB_SNS_SHIFT)

/**
 * FS0B pad sense low
 */
#define FS45_R_FS_FS0B_SNS_LOW           (0x00U << FS45_R_FS_FS0B_SNS_SHIFT)
/**
 * FS0B pad sense high
 */
#define FS45_R_FS_FS0B_SNS_HIGH          (0x01U << FS45_R_FS_FS0B_SNS_SHIFT)

/**
 * FS1B pad sense low
 */
#define FS45_R_FS_FS1B_SNS_LOW           (0x00U << FS45_R_FS_FS1B_SNS_SHIFT)
/**
 * FS1B pad sense high
 */
#define FS45_R_FS_FS1B_SNS_HIGH          (0x01U << FS45_R_FS_FS1B_SNS_SHIFT)

/******************************************************************************/
/* SF_OUTPUT_REQUEST - Type: RW                                               */
/******************************************************************************/

#define FS45_FS_SF_OUTPUT_REQUEST_ADDR   0x2BU
#define FS45_FS_SF_OUTPUT_REQUEST_DEFAULT 0x01U

/**
 * Sense of RSTB driver command from fail-safe logic
 */
#define FS45_R_FS_RSTB_DRV_MASK          0x01U
/**
 * Sense of FS0B driver command from fail-safe logic
 */
#define FS45_R_FS_FS0B_DRV_MASK          0x02U
/**
 * Sense of FS1B driver command from backup delay (analog)
 */
#define FS45_R_FS_FS1B_DLY_DRV_MASK      0x04U
/**
 * Sense of FS1B driver command from fail-safe logic (digital)
 */
#define FS45_R_FS_FS1B_DRV_MASK          0x08U
/**
 * Request a RSTB low pulse
 */
#define FS45_W_FS_RSTB_REQ_MASK          0x10U
/**
 * Request FS0B to be asserted low
 */
#define FS45_W_FS_FS0B_REQ_MASK          0x20U
/**
 * Request activation of FS1B backup delay (open/close switch S1)
 */
#define FS45_W_FS_FS1B_DLY_REQ_MASK      0x40U
/**
 * Request FS1B to be asserted low
 */
#define FS45_W_FS_FS1B_REQ_MASK          0x80U

/**
 * Sense of RSTB driver command from fail-safe logic
 */
#define FS45_R_FS_RSTB_DRV_SHIFT         0x00U
/**
 * Sense of FS0B driver command from fail-safe logic
 */
#define FS45_R_FS_FS0B_DRV_SHIFT         0x01U
/**
 * Sense of FS1B driver command from backup delay (analog)
 */
#define FS45_R_FS_FS1B_DLY_DRV_SHIFT     0x02U
/**
 * Sense of FS1B driver command from fail-safe logic (digital)
 */
#define FS45_R_FS_FS1B_DRV_SHIFT         0x03U
/**
 * Request a RSTB low pulse
 */
#define FS45_W_FS_RSTB_REQ_SHIFT         0x04U
/**
 * Request FS0B to be asserted low
 */
#define FS45_W_FS_FS0B_REQ_SHIFT         0x05U
/**
 * Request activation of FS1B backup delay (open/close switch S1)
 */
#define FS45_W_FS_FS1B_DLY_REQ_SHIFT     0x06U
/**
 * Request FS1B to be asserted low
 */
#define FS45_W_FS_FS1B_REQ_SHIFT         0x07U

/**
 * RSTB driver sense low
 */
#define FS45_R_FS_RSTB_DRV_LOW           (0x00U << FS45_R_FS_RSTB_DRV_SHIFT)
/**
 * RSTB driver sense high
 */
#define FS45_R_FS_RSTB_DRV_HIGH          (0x01U << FS45_R_FS_RSTB_DRV_SHIFT)

/**
 * FS0B driver sense low
 */
#define FS45_R_FS_FS0B_DRV_LOW           (0x00U << FS45_R_FS_FS0B_DRV_SHIFT)
/**
 * FS0B driver sense high
 */
#define FS45_R_FS_FS0B_DRV_HIGH          (0x01U << FS45_R_FS_FS0B_DRV_SHIFT)

/**
 * FS1B analog driver sense low
 */
#define FS45_R_FS_FS1B_DLY_DRV_FS1B_LOW  (0x00U << FS45_R_FS_FS1B_DLY_DRV_SHIFT)
/**
 * FS1B analog driver sense high
 */
#define FS45_R_FS_FS1B_DLY_DRV_FS1B_HIGH (0x01U << FS45_R_FS_FS1B_DLY_DRV_SHIFT)

/**
 * FS1B digital driver sense low
 */
#define FS45_R_FS_FS1B_DRV_FS1B_LOW      (0x00U << FS45_R_FS_FS1B_DRV_SHIFT)
/**
 * FS1B digital driver sense high
 */
#define FS45_R_FS_FS1B_DRV_FS1B_HIGH     (0x01U << FS45_R_FS_FS1B_DRV_SHIFT)

/**
 * No request
 */
#define FS45_W_FS_RSTB_REQ_NO_REQUEST    (0x00U << FS45_W_FS_RSTB_REQ_SHIFT)
/**
 * Request a RSTB low pulse
 */
#define FS45_W_FS_RSTB_REQ_RSTB_REQ      (0x01U << FS45_W_FS_RSTB_REQ_SHIFT)

/**
 * No request
 */
#define FS45_W_FS_FS0B_REQ_NO_REQUEST    (0x00U << FS45_W_FS_FS0B_REQ_SHIFT)
/**
 * Request FS0B assertion
 */
#define FS45_W_FS_FS0B_REQ_FS0B_REQ      (0x01U << FS45_W_FS_FS0B_REQ_SHIFT)

/**
 * No request (close S1)
 */
#define FS45_W_FS_FS1B_DLY_REQ_NO_REQUEST (0x00U << FS45_W_FS_FS1B_DLY_REQ_SHIFT)
/**
 * Request FS1B assertion with tDELAY controlled by the backup delay (open S1)
 */
#define FS45_W_FS_FS1B_DLY_REQ_FS1B_REQ  (0x01U << FS45_W_FS_FS1B_DLY_REQ_SHIFT)

/**
 * No request
 */
#define FS45_W_FS_FS1B_REQ_NO_REQUEST    (0x00U << FS45_W_FS_FS1B_REQ_SHIFT)
/**
 * Request FS1B assertion with immediate assertion, no delay
 */
#define FS45_W_FS_FS1B_REQ_FS1B_REQ      (0x01U << FS45_W_FS_FS1B_REQ_SHIFT)

/******************************************************************************/
/* INIT_WU1 - Type: RW                                                        */
/******************************************************************************/

#define FS45_M_INIT_WU1_ADDR             0x02U
#define FS45_M_INIT_WU1_DEFAULT          0x40U

/**
 * IO_4 wake-up configuration
 */
#define FS45_RW_M_WU_IO4_MASK            0x03U
/**
 * IO_3 wake-up configuration
 */
#define FS45_RW_M_WU_IO3_MASK            0x0CU
/**
 * IO_2 wake-up configuration
 */
#define FS45_RW_M_WU_IO2_MASK            0x30U
/**
 * IO_0 wake-up configuration
 */
#define FS45_RW_M_WU_IO0_MASK            0xC0U

/**
 * IO_4 wake-up configuration
 */
#define FS45_RW_M_WU_IO4_SHIFT           0x00U
/**
 * IO_3 wake-up configuration
 */
#define FS45_RW_M_WU_IO3_SHIFT           0x02U
/**
 * IO_2 wake-up configuration
 */
#define FS45_RW_M_WU_IO2_SHIFT           0x04U
/**
 * IO_0 wake-up configuration
 */
#define FS45_RW_M_WU_IO0_SHIFT           0x06U

/**
 * NO wake-up capability
 */
#define FS45_RW_M_WU_IO4_NO_WAKEUP       (0x00U << FS45_RW_M_WU_IO4_SHIFT)
/**
 * Wake-up on rising edge - or high level
 */
#define FS45_RW_M_WU_IO4_RISING_EDGE     (0x01U << FS45_RW_M_WU_IO4_SHIFT)
/**
 * Wake-up on falling edge - or low level
 */
#define FS45_RW_M_WU_IO4_FALLING_EDGE    (0x02U << FS45_RW_M_WU_IO4_SHIFT)
/**
 * Wake-up on any edge
 */
#define FS45_RW_M_WU_IO4_ANY_EDGE        (0x03U << FS45_RW_M_WU_IO4_SHIFT)

/**
 * NO wake-up capability
 */
#define FS45_RW_M_WU_IO3_NO_WAKEUP       (0x00U << FS45_RW_M_WU_IO3_SHIFT)
/**
 * Wake-up on rising edge - or high level
 */
#define FS45_RW_M_WU_IO3_RISING_EDGE     (0x01U << FS45_RW_M_WU_IO3_SHIFT)
/**
 * Wake-up on falling edge - or low level
 */
#define FS45_RW_M_WU_IO3_FALLING_EDGE    (0x02U << FS45_RW_M_WU_IO3_SHIFT)
/**
 * Wake-up on any edge
 */
#define FS45_RW_M_WU_IO3_ANY_EDGE        (0x03U << FS45_RW_M_WU_IO3_SHIFT)

/**
 * NO wake-up capability
 */
#define FS45_RW_M_WU_IO2_NO_WAKEUP       (0x00U << FS45_RW_M_WU_IO2_SHIFT)
/**
 * Wake-up on rising edge - or high level
 */
#define FS45_RW_M_WU_IO2_RISING_EDGE     (0x01U << FS45_RW_M_WU_IO2_SHIFT)
/**
 * Wake-up on falling edge - or low level
 */
#define FS45_RW_M_WU_IO2_FALLING_EDGE    (0x02U << FS45_RW_M_WU_IO2_SHIFT)
/**
 * Wake-up on any edge
 */
#define FS45_RW_M_WU_IO2_ANY_EDGE        (0x03U << FS45_RW_M_WU_IO2_SHIFT)

/**
 * NO wake-up capability
 */
#define FS45_RW_M_WU_IO0_NO_WAKEUP       (0x00U << FS45_RW_M_WU_IO0_SHIFT)
/**
 * Wake-up on rising edge - or high level
 */
#define FS45_RW_M_WU_IO0_RISING_EDGE     (0x01U << FS45_RW_M_WU_IO0_SHIFT)
/**
 * Wake-up on falling edge - or low level
 */
#define FS45_RW_M_WU_IO0_FALLING_EDGE    (0x02U << FS45_RW_M_WU_IO0_SHIFT)
/**
 * Wake-up on any edge
 */
#define FS45_RW_M_WU_IO0_ANY_EDGE        (0x03U << FS45_RW_M_WU_IO0_SHIFT)

/******************************************************************************/
/* INIT_WU2 - Type: RW                                                        */
/******************************************************************************/

#define FS45_M_INIT_WU2_ADDR             0x03U
#define FS45_M_INIT_WU2_DEFAULT          0x00U

/**
 * Configure the LIN slew rate
 */
#define FS45_RW_M_LIN_SR_MASK            0x03U
/**
 * To comply with J2602 standard. Recessive mode when VSUP < 7.0 V
 */
#define FS45_RW_M_LIN_J2602_DIS_MASK     0x04U
/**
 * Define the CAN wake-up timeout (when CAN_WU_CONF = 0)
 */
#define FS45_RW_M_CAN_WU_TO_MASK         0x10U
/**
 * Define CAN behavior when FS1B is asserted low
 */
#define FS45_RW_M_CAN_DIS_CFG_MASK       0x20U
/**
 * IO_5 wake-up configuration
 */
#define FS45_RW_M_WU_IO5_MASK            0xC0U

/**
 * Configure the LIN slew rate
 */
#define FS45_RW_M_LIN_SR_SHIFT           0x00U
/**
 * To comply with J2602 standard. Recessive mode when VSUP < 7.0 V
 */
#define FS45_RW_M_LIN_J2602_DIS_SHIFT    0x02U
/**
 * Define the CAN wake-up timeout (when CAN_WU_CONF = 0)
 */
#define FS45_RW_M_CAN_WU_TO_SHIFT        0x04U
/**
 * Define CAN behavior when FS1B is asserted low
 */
#define FS45_RW_M_CAN_DIS_CFG_SHIFT      0x05U
/**
 * IO_5 wake-up configuration
 */
#define FS45_RW_M_WU_IO5_SHIFT           0x06U

/**
 * 20 kbits/s
 */
#define FS45_RW_M_LIN_SR_20KBITS         (0x00U << FS45_RW_M_LIN_SR_SHIFT)
/**
 * 10 kbits/s
 */
#define FS45_RW_M_LIN_SR_10KBITS         (0x01U << FS45_RW_M_LIN_SR_SHIFT)
/**
 * Fast baud rate (Max: 100 kbits/s)
 */
#define FS45_RW_M_LIN_SR_FAST_RATE       (0x02U << FS45_RW_M_LIN_SR_SHIFT)

/**
 * Compliant with J2602 standard
 */
#define FS45_RW_M_LIN_J2602_DIS_COMPLIANT (0x00U << FS45_RW_M_LIN_J2602_DIS_SHIFT)
/**
 * Not compliant with J2602 standard
 */
#define FS45_RW_M_LIN_J2602_DIS_NOT_COMPLIANT (0x01U << FS45_RW_M_LIN_J2602_DIS_SHIFT)

/**
 * 120 us
 */
#define FS45_RW_M_CAN_WU_TO_120US        (0x00U << FS45_RW_M_CAN_WU_TO_SHIFT)
/**
 * 2.8 ms
 */
#define FS45_RW_M_CAN_WU_TO_2_8MS        (0x01U << FS45_RW_M_CAN_WU_TO_SHIFT)

/**
 * CAN in Rx only mode (when FS1B_CAN_ IMPACT = 1 in INIT_FAULT register)
 */
#define FS45_RW_M_CAN_DIS_CFG_RX_ONLY    (0x00U << FS45_RW_M_CAN_DIS_CFG_SHIFT)
/**
 * CAN in sleep mode (when FS1B_CAN_ IMPACT = 1 in INIT_FAULT register)
 */
#define FS45_RW_M_CAN_DIS_CFG_SLEEP      (0x01U << FS45_RW_M_CAN_DIS_CFG_SHIFT)

/**
 * NO wake-up capability
 */
#define FS45_RW_M_WU_IO5_NO_WAKEUP       (0x00U << FS45_RW_M_WU_IO5_SHIFT)
/**
 * Wake-up on rising edge - or high level
 */
#define FS45_RW_M_WU_IO5_RISING_EDGE     (0x01U << FS45_RW_M_WU_IO5_SHIFT)
/**
 * Wake-up on falling edge - or low level
 */
#define FS45_RW_M_WU_IO5_FALLING_EDGE    (0x02U << FS45_RW_M_WU_IO5_SHIFT)
/**
 * Wake-up on any edge
 */
#define FS45_RW_M_WU_IO5_ANY_EDGE        (0x03U << FS45_RW_M_WU_IO5_SHIFT)

/******************************************************************************/
/* INIT_INH_INT - Type: RW                                                    */
/******************************************************************************/

