OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_M_INIT_INH_INT_ADDR         0x05U
#define FS45_M_INIT_INH_INT_DEFAULT      0x06U

/**
 * Inhibit the interrupt pulse for IO_0 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_0_MASK         0x01U
/**
 * Inhibit the interrupt pulse for IO_2 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_2_MASK         0x02U
/**
 * Inhibit the interrupt pulse for IO_3 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_3_MASK         0x04U
/**
 * Inhibit the interrupt pulse for IO_4 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_4_MASK         0x08U
/**
 * Inhibit the interrupt pulse for IO_5 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_5_MASK         0x10U

/**
 * Inhibit the interrupt pulse for IO_0 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_0_SHIFT        0x00U
/**
 * Inhibit the interrupt pulse for IO_2 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_2_SHIFT        0x01U
/**
 * Inhibit the interrupt pulse for IO_3 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_3_SHIFT        0x02U
/**
 * Inhibit the interrupt pulse for IO_4 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_4_SHIFT        0x03U
/**
 * Inhibit the interrupt pulse for IO_5 (masked in IO_G)
 */
#define FS45_RW_M_INT_INH_5_SHIFT        0x04U

/**
 * INT not masked
 */
#define FS45_RW_M_INT_INH_0_NOT_MASKED   (0x00U << FS45_RW_M_INT_INH_0_SHIFT)
/**
 * INT masked
 */
#define FS45_RW_M_INT_INH_0_MASKED       (0x01U << FS45_RW_M_INT_INH_0_SHIFT)

/**
 * INT not masked
 */
#define FS45_RW_M_INT_INH_2_NOT_MASKED   (0x00U << FS45_RW_M_INT_INH_2_SHIFT)
/**
 * INT masked
 */
#define FS45_RW_M_INT_INH_2_MASKED       (0x01U << FS45_RW_M_INT_INH_2_SHIFT)

/**
 * INT not masked
 */
#define FS45_RW_M_INT_INH_3_NOT_MASKED   (0x00U << FS45_RW_M_INT_INH_3_SHIFT)
/**
 * INT masked
 */
#define FS45_RW_M_INT_INH_3_MASKED       (0x01U << FS45_RW_M_INT_INH_3_SHIFT)

/**
 * INT not masked
 */
#define FS45_RW_M_INT_INH_4_NOT_MASKED   (0x00U << FS45_RW_M_INT_INH_4_SHIFT)
/**
 * INT masked
 */
#define FS45_RW_M_INT_INH_4_MASKED       (0x01U << FS45_RW_M_INT_INH_4_SHIFT)

/**
 * INT not masked
 */
#define FS45_RW_M_INT_INH_5_NOT_MASKED   (0x00U << FS45_RW_M_INT_INH_5_SHIFT)
/**
 * INT masked
 */
#define FS45_RW_M_INT_INH_5_MASKED       (0x01U << FS45_RW_M_INT_INH_5_SHIFT)

/******************************************************************************/
/* INIT_FS1B_TIMING - Type: RW                                                */
/******************************************************************************/

#define FS45_FS_INIT_FS1B_TIMING_ADDR    0x21U
#define FS45_FS_INIT_FS1B_TIMING_DEFAULT 0x06U

/**
 * FS1B timing range factor x1(FS1B_TIME_RANGE bit = 0), FS1B timing range factor x8(FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_MASK         0x0FU
/**
 * FS1B timing range factor x1(FS1B_TIME_RANGE bit = 0), FS1B timing range factor x8(FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_MASK         0xF0U

/**
 * FS1B timing range factor x1(FS1B_TIME_RANGE bit = 0), FS1B timing range factor x8(FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_SHIFT        0x00U
/**
 * FS1B timing range factor x1(FS1B_TIME_RANGE bit = 0), FS1B timing range factor x8(FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_SHIFT        0x04U

/**
 * 0
 */
#define FS45_R_FS_FS1B_TIME_0_0          (0x00U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 10 ms (FS1B_TIME_RANGE bit = 0) | 80 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_10MS_80MS    (0x01U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 13 ms (FS1B_TIME_RANGE bit = 0) | 104 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_13_104MS     (0x02U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 17 ms (FS1B_TIME_RANGE bit = 0) | 135 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_17_135MS     (0x03U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 22 ms (FS1B_TIME_RANGE bit = 0) | 176 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_22_176MS     (0x04U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 29 ms (FS1B_TIME_RANGE bit = 0) | 228 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_29_228MS     (0x05U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 37 ms (FS1B_TIME_RANGE bit = 0) | 297 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_37_297MS     (0x06U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 48 ms (FS1B_TIME_RANGE bit = 0) | 386 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_48_386MS     (0x07U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 63 ms (FS1B_TIME_RANGE bit = 0) | 502 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_63_502MS     (0x08U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 82 ms (FS1B_TIME_RANGE bit = 0) | 653 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_82_653MS     (0x09U << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 106 ms (FS1B_TIME_RANGE bit = 0) | 848 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_106_848MS    (0x0AU << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 138 ms (FS1B_TIME_RANGE bit = 0) | 1103 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_138_1103MS   (0x0BU << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 179 ms (FS1B_TIME_RANGE bit = 0) | 1434 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_179_1434MS   (0x0CU << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 233 ms (FS1B_TIME_RANGE bit = 0) | 1864 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_233_1864MS   (0x0DU << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 303 ms (FS1B_TIME_RANGE bit = 0) | 2423 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_303_2423MS   (0x0EU << FS45_R_FS_FS1B_TIME_SHIFT)
/**
 * 394 ms (FS1B_TIME_RANGE bit = 0) | 3150 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_R_FS_FS1B_TIME_394_3150MS   (0x0FU << FS45_R_FS_FS1B_TIME_SHIFT)

/**
 * 0
 */
#define FS45_W_FS_FS1B_TIME_0_0          (0x00U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 10 ms (FS1B_TIME_RANGE bit = 0) | 80 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_10MS_80MS    (0x01U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 13 ms (FS1B_TIME_RANGE bit = 0) | 104 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_13_104MS     (0x02U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 17 ms (FS1B_TIME_RANGE bit = 0) | 135 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_17_135MS     (0x03U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 22 ms (FS1B_TIME_RANGE bit = 0) | 176 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_22_176MS     (0x04U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 29 ms (FS1B_TIME_RANGE bit = 0) | 228 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_29_228MS     (0x05U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 37 ms (FS1B_TIME_RANGE bit = 0) | 297 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_37_297MS     (0x06U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 48 ms (FS1B_TIME_RANGE bit = 0) | 386 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_48_386MS     (0x07U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 63 ms (FS1B_TIME_RANGE bit = 0) | 502 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_63_502MS     (0x08U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 82 ms (FS1B_TIME_RANGE bit = 0) | 653 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_82_653MS     (0x09U << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 106 ms (FS1B_TIME_RANGE bit = 0) | 848 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_106_848MS    (0x0AU << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 138 ms (FS1B_TIME_RANGE bit = 0) | 1103 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_138_1103MS   (0x0BU << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 179 ms (FS1B_TIME_RANGE bit = 0) | 1434 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_179_1434MS   (0x0CU << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 233 ms (FS1B_TIME_RANGE bit = 0) | 1864 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_233_1864MS   (0x0DU << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 303 ms (FS1B_TIME_RANGE bit = 0) | 2423 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_303_2423MS   (0x0EU << FS45_W_FS_FS1B_TIME_SHIFT)
/**
 * 394 ms (FS1B_TIME_RANGE bit = 0) | 3150 ms (FS1B_TIME_RANGE bit = 1)
 */
#define FS45_W_FS_FS1B_TIME_394_3150MS   (0x0FU << FS45_W_FS_FS1B_TIME_SHIFT)

/******************************************************************************/
/* INIT_SUPERVISOR - Type: RW                                                 */
/******************************************************************************/

#define FS45_FS_INIT_SUPERVISOR_ADDR     0x23U
#define FS45_FS_INIT_SUPERVISOR_DEFAULT  0x00U

/**
 * Configure the FS1B timing range factor x1 or x8
 */
#define FS45_R_FS_FS1B_TIME_RANGE_MASK   0x01U
/**
 * Configure the VAUX undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_R_FS_VAUX_5D_MASK           0x02U
/**
 * Configure the VCCA undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_R_FS_VCCA_5D_MASK           0x04U
/**
 * Configure the VCORE undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_R_FS_VCORE_5D_MASK          0x08U
/**
 * Configure the FS1B timing range factor x1 or x8
 */
#define FS45_W_FS_FS1B_TIME_RANGE_MASK   0x10U
/**
 * Configure the VAUX undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_W_FS_VAUX_5D_MASK           0x20U
/**
 * Configure the VCCA undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_W_FS_VCCA_5D_MASK           0x40U
/**
 * Configure the VCORE undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_W_FS_VCORE_5D_MASK          0x80U

/**
 * Configure the FS1B timing range factor x1 or x8
 */
#define FS45_R_FS_FS1B_TIME_RANGE_SHIFT  0x00U
/**
 * Configure the VAUX undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_R_FS_VAUX_5D_SHIFT          0x01U
/**
 * Configure the VCCA undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_R_FS_VCCA_5D_SHIFT          0x02U
/**
 * Configure the VCORE undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_R_FS_VCORE_5D_SHIFT         0x03U
/**
 * Configure the FS1B timing range factor x1 or x8
 */
#define FS45_W_FS_FS1B_TIME_RANGE_SHIFT  0x04U
/**
 * Configure the VAUX undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_W_FS_VAUX_5D_SHIFT          0x05U
/**
 * Configure the VCCA undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_W_FS_VCCA_5D_SHIFT          0x06U
/**
 * Configure the VCORE undervoltage in degraded mode. Only valid for 5.0 V
 */
#define FS45_W_FS_VCORE_5D_SHIFT         0x07U

/**
 * x1 timing range factor
 */
#define FS45_R_FS_FS1B_TIME_RANGE_X1     (0x00U << FS45_R_FS_FS1B_TIME_RANGE_SHIFT)
/**
 * x8 timing range factor
 */
#define FS45_R_FS_FS1B_TIME_RANGE_X8     (0x01U << FS45_R_FS_FS1B_TIME_RANGE_SHIFT)

/**
 * Normal 5.0 V undervoltage detection threshold (VAUX_UV_5)
 */
#define FS45_R_FS_VAUX_5D_NORMAL         (0x00U << FS45_R_FS_VAUX_5D_SHIFT)
/**
 * Degraded mode; lower undervoltage detection threshold applied (VAUX_UV_5D)
 */
#define FS45_R_FS_VAUX_5D_DEGRADED       (0x01U << FS45_R_FS_VAUX_5D_SHIFT)

/**
 * Normal 5.0 V undervoltage detection threshold (VCCA_UV_5)
 */
#define FS45_R_FS_VCCA_5D_NORMAL         (0x00U << FS45_R_FS_VCCA_5D_SHIFT)
/**
 * Degraded mode, lower undervoltage detection threshold applied (VCCA_UV_D)
 */
#define FS45_R_FS_VCCA_5D_DEGRADED       (0x01U << FS45_R_FS_VCCA_5D_SHIFT)

/**
 * Normal 5.0 V undervoltage detection threshold (VCORE_FB_UV)
 */
#define FS45_R_FS_VCORE_5D_NORMAL        (0x00U << FS45_R_FS_VCORE_5D_SHIFT)
/**
 * Degraded mode, lower undervoltage detection threshold applied (VCORE_FB_UV_D)
 */
#define FS45_R_FS_VCORE_5D_DEGRADED      (0x01U << FS45_R_FS_VCORE_5D_SHIFT)

/**
 * x1 timing range factor
 */
#define FS45_W_FS_FS1B_TIME_RANGE_X1     (0x00U << FS45_W_FS_FS1B_TIME_RANGE_SHIFT)
/**
 * x8 timing range factor
 */
#define FS45_W_FS_FS1B_TIME_RANGE_X8     (0x01U << FS45_W_FS_FS1B_TIME_RANGE_SHIFT)

/**
 * Normal 5.0 V undervoltage detection threshold (VAUX_UV_5)
 */
#define FS45_W_FS_VAUX_5D_NORMAL         (0x00U << FS45_W_FS_VAUX_5D_SHIFT)
/**
 * Degraded mode; lower undervoltage detection threshold applied (VAUX_UV_5D)
 */
#define FS45_W_FS_VAUX_5D_DEGRADED       (0x01U << FS45_W_FS_VAUX_5D_SHIFT)

/**
 * Normal 5.0 V undervoltage detection threshold (VCCA_UV_5)
 */
#define FS45_W_FS_VCCA_5D_NORMAL         (0x00U << FS45_W_FS_VCCA_5D_SHIFT)
/**
 * Degraded mode, lower undervoltage detection threshold applied (VCCA_UV_D)
 */
#define FS45_W_FS_VCCA_5D_DEGRADED       (0x01U << FS45_W_FS_VCCA_5D_SHIFT)

/**
 * Normal 5.0 V undervoltage detection threshold (VCORE_FB_UV)
 */
#define FS45_W_FS_VCORE_5D_NORMAL        (0x00U << FS45_W_FS_VCORE_5D_SHIFT)
/**
 * Degraded mode, lower undervoltage detection threshold applied (VCORE_FB_UV_D)
 */
#define FS45_W_FS_VCORE_5D_DEGRADED      (0x01U << FS45_W_FS_VCORE_5D_SHIFT)

/******************************************************************************/
/* INIT_FAULT - Type: RW                                                      */
/******************************************************************************/

#define FS45_FS_INIT_FAULT_ADDR          0x24U
#define FS45_FS_INIT_FAULT_DEFAULT       0x05U

/**
 * Configure RSTB and FS0B behavior when fault error counter >= intermediate value
 */
#define FS45_R_FS_FLT_ERR_IMP_MASK       0x03U
/**
 * Configure CAN behavior when FS1B is asserted low
 */
#define FS45_R_FS_FS1B_CAN_IMPACT_MASK   0x04U
/**
 * Configure the values of the fault error counter
 */
#define FS45_R_FS_FLT_ERR_FS_MASK        0x08U
/**
 * Configure RSTB and FS0B behavior when fault error counter >= intermediate value
 */
#define FS45_W_FS_FLT_ERR_IMP_MASK       0x30U
/**
 * Configure CAN behavior when FS1B is asserted low
 */
#define FS45_W_FS_FS1B_CAN_IMPACT_MASK   0x40U
/**
 * Configure the values of the fault error counter
 */
#define FS45_W_FS_FLT_ERR_FS_MASK        0x80U

/**
 * Configure RSTB and FS0B behavior when fault error counter >= intermediate value
 */
#define FS45_R_FS_FLT_ERR_IMP_SHIFT      0x00U
/**
 * Configure CAN behavior when FS1B is asserted low
 */
#define FS45_R_FS_FS1B_CAN_IMPACT_SHIFT  0x02U
/**
 * Configure the values of the fault error counter
 */
#define FS45_R_FS_FLT_ERR_FS_SHIFT       0x03U
/**
 * Configure RSTB and FS0B behavior when fault error counter >= intermediate value
 */
#define FS45_W_FS_FLT_ERR_IMP_SHIFT      0x04U
/**
 * Configure CAN behavior when FS1B is asserted low
 */
#define FS45_W_FS_FS1B_CAN_IMPACT_SHIFT  0x06U
/**
 * Configure the values of the fault error counter
 */
#define FS45_W_FS_FLT_ERR_FS_SHIFT       0x07U

/**
 * No effect on RSTB and FS0B
 */
#define FS45_R_FS_FLT_ERR_IMP_NO_EFFECT  (0x00U << FS45_R_FS_FLT_ERR_IMP_SHIFT)
/**
 * FS0B is asserted low if FLT_ERR_CNT >= intermediate value
 */
#define FS45_R_FS_FLT_ERR_IMP_FS0B       (0x01U << FS45_R_FS_FLT_ERR_IMP_SHIFT)
/**
 * RSTB is asserted low if FLT_ERR_CNT >= intermediate value and WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_R_FS_FLT_ERR_IMP_RSTB       (0x02U << FS45_R_FS_FLT_ERR_IMP_SHIFT)
/**
 * FS0B is asserted low if FLT_ERR_CNT >= intermediate value RSTB is asserted low if FLT_ERR_CNT >= intermediate value 
 * and WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_R_FS_FLT_ERR_IMP_FS0B_RSTB  (0x03U << FS45_R_FS_FLT_ERR_IMP_SHIFT)

/**
 * No effect
 */
#define FS45_R_FS_FS1B_CAN_IMPACT_NO_EFFECT (0x00U << FS45_R_FS_FS1B_CAN_IMPACT_SHIFT)
/**
 * CAN in Rx only or sleep mode when FS1B is asserted (depends on CAN_DIS_CFG bit in INIT_WU2 register)
 */
#define FS45_R_FS_FS1B_CAN_IMPACT_RX_ONLY (0x01U << FS45_R_FS_FS1B_CAN_IMPACT_SHIFT)

/**
 * intermediate = 3; final = 6
 */
#define FS45_R_FS_FLT_ERR_FS_INT3_FIN6   (0x00U << FS45_R_FS_FLT_ERR_FS_SHIFT)
/**
 * intermediate = 1; final = 2
 */
#define FS45_R_FS_FLT_ERR_FS_INT1_FIN2   (0x01U << FS45_R_FS_FLT_ERR_FS_SHIFT)

/**
 * No effect on RSTB and FS0B
 */
#define FS45_W_FS_FLT_ERR_IMP_NO_EFFECT  (0x00U << FS45_W_FS_FLT_ERR_IMP_SHIFT)
/**
 * FS0B is asserted low if FLT_ERR_CNT >= intermediate value
 */
#define FS45_W_FS_FLT_ERR_IMP_FS0B       (0x01U << FS45_W_FS_FLT_ERR_IMP_SHIFT)
/**
 * RSTB is asserted low if FLT_ERR_CNT >= intermediate value and WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_W_FS_FLT_ERR_IMP_RSTB       (0x02U << FS45_W_FS_FLT_ERR_IMP_SHIFT)
/**
 * FS0B is asserted low if FLT_ERR_CNT >= intermediate value RSTB is asserted low if FLT_ERR_CNT >= intermediate value 
 * and WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_W_FS_FLT_ERR_IMP_FS0B_RSTB  (0x03U << FS45_W_FS_FLT_ERR_IMP_SHIFT)

/**
 * No effect
 */
#define FS45_W_FS_FS1B_CAN_IMPACT_NO_EFFECT (0x00U << FS45_W_FS_FS1B_CAN_IMPACT_SHIFT)
/**
 * CAN in Rx only or sleep mode when FS1B is asserted (depends on CAN_DIS_CFG bit in INIT_WU2 register)
 */
#define FS45_W_FS_FS1B_CAN_IMPACT_RX_ONLY (0x01U << FS45_W_FS_FS1B_CAN_IMPACT_SHIFT)

/**
 * intermediate = 3; final = 6
 */
#define FS45_W_FS_FLT_ERR_FS_INT3_FIN6   (0x00U << FS45_W_FS_FLT_ERR_FS_SHIFT)
/**
 * intermediate = 1; final = 2
 */
#define FS45_W_FS_FLT_ERR_FS_INT1_FIN2   (0x01U << FS45_W_FS_FLT_ERR_FS_SHIFT)

/******************************************************************************/
/* INIT_FSSM - Type: RW                                                       */
/******************************************************************************/

#define FS45_FS_INIT_FSSM_ADDR           0x25U
#define FS45_FS_INIT_FSSM_DEFAULT        0x04U

/**
 * Configure the RSTB low duration time
 */
#define FS45_R_FS_RSTB_DURATION_MASK     0x01U
/**
 * Configure the FCCU polarity
 */
#define FS45_R_FS_PS_MASK                0x02U
/**
 * Configure the couple of IO_3:2 as safety inputs for FCCU monitoring
 */
#define FS45_R_FS_IO_23_FS_MASK          0x04U
/**
 * Configure the couple of IO_4:5 as safety inputs for external IC error monitoring
 */
#define FS45_R_FS_IO_45_FS_MASK          0x08U
/**
 * Configure the RSTB low duration time
 */
#define FS45_W_FS_RSTB_DURATION_MASK     0x10U
/**
 * Configure the FCCU polarity
 */
#define FS45_W_FS_PS_MASK                0x20U
/**
 * Configure the couple of IO_3:2 as safety inputs for FCCU monitoring
 */
#define FS45_W_FS_IO_23_FS_MASK          0x40U
/**
 * Configure the couple of IO_4:5 as safety inputs for external IC error monitoring
 */
#define FS45_W_FS_IO_45_FS_MASK          0x80U

/**
 * Configure the RSTB low duration time
 */
#define FS45_R_FS_RSTB_DURATION_SHIFT    0x00U
/**
 * Configure the FCCU polarity
 */
#define FS45_R_FS_PS_SHIFT               0x01U
/**
 * Configure the couple of IO_3:2 as safety inputs for FCCU monitoring
 */
#define FS45_R_FS_IO_23_FS_SHIFT         0x02U
/**
 * Configure the couple of IO_4:5 as safety inputs for external IC error monitoring
 */
#define FS45_R_FS_IO_45_FS_SHIFT         0x03U
/**
 * Configure the RSTB low duration time
 */
#define FS45_W_FS_RSTB_DURATION_SHIFT    0x04U
/**
 * Configure the FCCU polarity
 */
#define FS45_W_FS_PS_SHIFT               0x05U
/**
 * Configure the couple of IO_3:2 as safety inputs for FCCU monitoring
 */
#define FS45_W_FS_IO_23_FS_SHIFT         0x06U
/**
 * Configure the couple of IO_4:5 as safety inputs for external IC error monitoring
 */
#define FS45_W_FS_IO_45_FS_SHIFT         0x07U

/**
 * 10 ms
 */
#define FS45_R_FS_RSTB_DURATION_10MS     (0x00U << FS45_R_FS_RSTB_DURATION_SHIFT)
/**
 * 1.0 ms
 */
#define FS45_R_FS_RSTB_DURATION_1MS      (0x01U << FS45_R_FS_RSTB_DURATION_SHIFT)

/**
 * Fccu_eaout_1:0 active high
 */
#define FS45_R_FS_PS_HIGH                (0x00U << FS45_R_FS_PS_SHIFT)
/**
 * Fccu_eaout_1:0 active low
 */
#define FS45_R_FS_PS_LOW                 (0x01U << FS45_R_FS_PS_SHIFT)

/**
 * Not_safety
 */
#define FS45_R_FS_IO_23_FS_NOT_SAFETY    (0x00U << FS45_R_FS_IO_23_FS_SHIFT)
/**
 * Safety_critical
 */
#define FS45_R_FS_IO_23_FS_SAFETY_CRITICAL (0x01U << FS45_R_FS_IO_23_FS_SHIFT)

/**
 * Not safety
 */
#define FS45_R_FS_IO_45_FS_NOT_SAFETY    (0x00U << FS45_R_FS_IO_45_FS_SHIFT)
/**
 * Safety critical
 */
#define FS45_R_FS_IO_45_FS_SAFETY_CRITICAL (0x01U << FS45_R_FS_IO_45_FS_SHIFT)

/**
 * 10 ms
 */
#define FS45_W_FS_RSTB_DURATION_10MS     (0x00U << FS45_W_FS_RSTB_DURATION_SHIFT)
/**
 * 1.0 ms
 */
#define FS45_W_FS_RSTB_DURATION_1MS      (0x01U << FS45_W_FS_RSTB_DURATION_SHIFT)

/**
 * Fccu_eaout_1:0 active high
 */
#define FS45_W_FS_PS_HIGH                (0x00U << FS45_W_FS_PS_SHIFT)
/**
 * Fccu_eaout_1:0 active low
 */
#define FS45_W_FS_PS_LOW                 (0x01U << FS45_W_FS_PS_SHIFT)

/**
 * Not_safety
 */
#define FS45_W_FS_IO_23_FS_NOT_SAFETY    (0x00U << FS45_W_FS_IO_23_FS_SHIFT)
/**
 * Safety_critical
 */
#define FS45_W_FS_IO_23_FS_SAFETY_CRITICAL (0x01U << FS45_W_FS_IO_23_FS_SHIFT)

/**
 * Not safety
 */
#define FS45_W_FS_IO_45_FS_NOT_SAFETY    (0x00U << FS45_W_FS_IO_45_FS_SHIFT)
/**
 * Safety critical
 */
#define FS45_W_FS_IO_45_FS_SAFETY_CRITICAL (0x01U << FS45_W_FS_IO_45_FS_SHIFT)

/******************************************************************************/
/* INIT_SF_IMPACT - Type: RW                                                  */
/******************************************************************************/

#define FS45_FS_INIT_SF_IMPACT_ADDR      0x26U
#define FS45_FS_INIT_SF_IMPACT_DEFAULT   0x01U

/**
 * Watchdog impact on RSTB and/or FS0B assertion
 */
#define FS45_R_FS_WD_IMPACT_MASK         0x03U
/**
 * Watchdog impact on RSTB and/or FS0B assertion
 */
#define FS45_R_FS_DIS_8S_MASK            0x04U
/**
 * FS1B delay or FS1B duration mode selection
 */
#define FS45_R_FS_TDLY_TDUR_MASK         0x08U
/**
 * Watchdog impact on RSTB and/or FS0B assertion
 */
#define FS45_W_FS_WD_IMPACT_MASK         0x30U
/**
 * Watchdog impact on RSTB and/or FS0B assertion
 */
#define FS45_W_FS_DIS_8S_MASK            0x40U
/**
 * FS1B delay or FS1B duration mode selection
 */
#define FS45_W_FS_TDLY_TDUR_MASK         0x80U

/**
 * Watchdog impact on RSTB and/or FS0B assertion
 */
#define FS45_R_FS_WD_IMPACT_SHIFT        0x00U
/**
 * Watchdog impact on RSTB and/or FS0B assertion
 */
#define FS45_R_FS_DIS_8S_SHIFT           0x02U
/**
 * FS1B delay or FS1B duration mode selection
 */
#define FS45_R_FS_TDLY_TDUR_SHIFT        0x03U
/**
 * Watchdog impact on RSTB and/or FS0B assertion
 */
#define FS45_W_FS_WD_IMPACT_SHIFT        0x04U
/**
 * Watchdog impact on RSTB and/or FS0B assertion
 */
#define FS45_W_FS_DIS_8S_SHIFT           0x06U
/**
 * FS1B delay or FS1B duration mode selection
 */
#define FS45_W_FS_TDLY_TDUR_SHIFT        0x07U

/**
 * No effect on RSTB and FS0B if WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_R_FS_WD_IMPACT_NO_EFFECT    (0x00U << FS45_R_FS_WD_IMPACT_SHIFT)
/**
 * RSTB only is asserted low if WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_R_FS_WD_IMPACT_RSTB         (0x01U << FS45_R_FS_WD_IMPACT_SHIFT)
/**
 * FS0B only is asserted low if WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_R_FS_WD_IMPACT_FS0B         (0x02U << FS45_R_FS_WD_IMPACT_SHIFT)
/**
 * RSTB and FS0B are asserted low if WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_R_FS_WD_IMPACT_RSTB_FS0B    (0x03U << FS45_R_FS_WD_IMPACT_SHIFT)

/**
 * Enabled
 */
#define FS45_R_FS_DIS_8S_ENABLED         (0x00U << FS45_R_FS_DIS_8S_SHIFT)
/**
 * Disabled
 */
#define FS45_R_FS_DIS_8S_DISABLED        (0x01U << FS45_R_FS_DIS_8S_SHIFT)

/**
 * FS1B tDELAY mode
 */
#define FS45_R_FS_TDLY_TDUR_DELAY        (0x00U << FS45_R_FS_TDLY_TDUR_SHIFT)
/**
 * FS1B tDURATION mode
 */
#define FS45_R_FS_TDLY_TDUR_DURATION     (0x01U << FS45_R_FS_TDLY_TDUR_SHIFT)

