OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
/**
 * No effect on RSTB and FS0B if WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_W_FS_WD_IMPACT_NO_EFFECT    (0x00U << FS45_W_FS_WD_IMPACT_SHIFT)
/**
 * RSTB only is asserted low if WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_W_FS_WD_IMPACT_RSTB         (0x01U << FS45_W_FS_WD_IMPACT_SHIFT)
/**
 * FS0B only is asserted low if WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_W_FS_WD_IMPACT_FS0B         (0x02U << FS45_W_FS_WD_IMPACT_SHIFT)
/**
 * RSTB and FS0B are asserted low if WD error counter = WD_CNT_ERR[1:0]
 */
#define FS45_W_FS_WD_IMPACT_RSTB_FS0B    (0x03U << FS45_W_FS_WD_IMPACT_SHIFT)

/**
 * Enabled
 */
#define FS45_W_FS_DIS_8S_ENABLED         (0x00U << FS45_W_FS_DIS_8S_SHIFT)
/**
 * Disabled
 */
#define FS45_W_FS_DIS_8S_DISABLED        (0x01U << FS45_W_FS_DIS_8S_SHIFT)

/**
 * FS1B tDELAY mode
 */
#define FS45_W_FS_TDLY_TDUR_DELAY        (0x00U << FS45_W_FS_TDLY_TDUR_SHIFT)
/**
 * FS1B tDURATION mode
 */
#define FS45_W_FS_TDLY_TDUR_DURATION     (0x01U << FS45_W_FS_TDLY_TDUR_SHIFT)

/******************************************************************************/
/* WD_WINDOW - Type: RW                                                       */
/******************************************************************************/

#define FS45_FS_WD_WINDOW_ADDR           0x27U
#define FS45_FS_WD_WINDOW_DEFAULT        0x03U

/**
 * Configure the watchdog window duration. Duty cycle is set to 50 %
 */
#define FS45_R_FS_WD_WINDOW_MASK         0x0FU
/**
 * Configure the watchdog window duration. Duty cycle is set to 50 %
 */
#define FS45_W_FS_WD_WINDOW_MASK         0xF0U

/**
 * Configure the watchdog window duration. Duty cycle is set to 50 %
 */
#define FS45_R_FS_WD_WINDOW_SHIFT        0x00U
/**
 * Configure the watchdog window duration. Duty cycle is set to 50 %
 */
#define FS45_W_FS_WD_WINDOW_SHIFT        0x04U

/**
 * Disable (in INIT phase only)
 */
#define FS45_R_FS_WD_WINDOW_DISABLE      (0x00U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 1.0 ms
 */
#define FS45_R_FS_WD_WINDOW_1MS          (0x01U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 2.0 ms
 */
#define FS45_R_FS_WD_WINDOW_2MS          (0x02U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 3.0 ms
 */
#define FS45_R_FS_WD_WINDOW_3MS          (0x03U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 4.0 ms
 */
#define FS45_R_FS_WD_WINDOW_4MS          (0x04U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 6.0 ms
 */
#define FS45_R_FS_WD_WINDOW_6MS          (0x05U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 8.0 ms
 */
#define FS45_R_FS_WD_WINDOW_8MS          (0x06U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 12 ms
 */
#define FS45_R_FS_WD_WINDOW_12MS         (0x07U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 16 ms
 */
#define FS45_R_FS_WD_WINDOW_16MS         (0x08U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 24 ms
 */
#define FS45_R_FS_WD_WINDOW_24MS         (0x09U << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 32 ms
 */
#define FS45_R_FS_WD_WINDOW_32MS         (0x0AU << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 64 ms
 */
#define FS45_R_FS_WD_WINDOW_64MS         (0x0BU << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 128 ms
 */
#define FS45_R_FS_WD_WINDOW_128MS        (0x0CU << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 256 ms
 */
#define FS45_R_FS_WD_WINDOW_256MS        (0x0DU << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 512 ms
 */
#define FS45_R_FS_WD_WINDOW_512MS        (0x0EU << FS45_R_FS_WD_WINDOW_SHIFT)
/**
 * 1024 ms
 */
#define FS45_R_FS_WD_WINDOW_1024MS       (0x0FU << FS45_R_FS_WD_WINDOW_SHIFT)

/**
 * Disable (in INIT phase only)
 */
#define FS45_W_FS_WD_WINDOW_DISABLE      (0x00U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 1.0 ms
 */
#define FS45_W_FS_WD_WINDOW_1MS          (0x01U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 2.0 ms
 */
#define FS45_W_FS_WD_WINDOW_2MS          (0x02U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 3.0 ms
 */
#define FS45_W_FS_WD_WINDOW_3MS          (0x03U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 4.0 ms
 */
#define FS45_W_FS_WD_WINDOW_4MS          (0x04U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 6.0 ms
 */
#define FS45_W_FS_WD_WINDOW_6MS          (0x05U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 8.0 ms
 */
#define FS45_W_FS_WD_WINDOW_8MS          (0x06U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 12 ms
 */
#define FS45_W_FS_WD_WINDOW_12MS         (0x07U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 16 ms
 */
#define FS45_W_FS_WD_WINDOW_16MS         (0x08U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 24 ms
 */
#define FS45_W_FS_WD_WINDOW_24MS         (0x09U << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 32 ms
 */
#define FS45_W_FS_WD_WINDOW_32MS         (0x0AU << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 64 ms
 */
#define FS45_W_FS_WD_WINDOW_64MS         (0x0BU << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 128 ms
 */
#define FS45_W_FS_WD_WINDOW_128MS        (0x0CU << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 256 ms
 */
#define FS45_W_FS_WD_WINDOW_256MS        (0x0DU << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 512 ms
 */
#define FS45_W_FS_WD_WINDOW_512MS        (0x0EU << FS45_W_FS_WD_WINDOW_SHIFT)
/**
 * 1024 ms
 */
#define FS45_W_FS_WD_WINDOW_1024MS       (0x0FU << FS45_W_FS_WD_WINDOW_SHIFT)

/******************************************************************************/
/* WD_LFSR - Type: RW                                                         */
/******************************************************************************/

#define FS45_FS_WD_LFSR_ADDR             0x28U
#define FS45_FS_WD_LFSR_DEFAULT          0xB2U

/**
 * WD 8 bits LFSR value. Used to write the seed at any time. Default value at start-up or after a power on reset: 0xB2 
 * bit7:bit0: 10110010. Value Bit7:Bit0: 1111 1111 is prohibited. During a write command, MISO reports the previous 
 * register content.
 */
#define FS45_RW_FS_WD_LFSR_MASK          0xFFU

/**
 * WD 8 bits LFSR value. Used to write the seed at any time. Default value at start-up or after a power on reset: 0xB2 
 * bit7:bit0: 10110010. Value Bit7:Bit0: 1111 1111 is prohibited. During a write command, MISO reports the previous 
 * register content.
 */
#define FS45_RW_FS_WD_LFSR_SHIFT         0x00U

/******************************************************************************/
/* INIT_WD_CNT - Type: RW                                                     */
/******************************************************************************/

