OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_FS_INIT_WD_CNT_ADDR         0x2CU
#define FS45_FS_INIT_WD_CNT_DEFAULT      0x00U

/**
 * Configure the maximum value of the WD refresh counter
 */
#define FS45_R_FS_WD_CNT_RFR_MASK        0x03U
/**
 * Configure the maximum value of the WD error counter
 */
#define FS45_R_FS_WD_CNT_ERR_MASK        0x0CU
/**
 * Configure the maximum value of the WD refresh counter
 */
#define FS45_W_FS_WD_CNT_RFR_MASK        0x30U
/**
 * Configure the maximum value of the WD error counter
 */
#define FS45_W_FS_WD_CNT_ERR_MASK        0xC0U

/**
 * Configure the maximum value of the WD refresh counter
 */
#define FS45_R_FS_WD_CNT_RFR_SHIFT       0x00U
/**
 * Configure the maximum value of the WD error counter
 */
#define FS45_R_FS_WD_CNT_ERR_SHIFT       0x02U
/**
 * Configure the maximum value of the WD refresh counter
 */
#define FS45_W_FS_WD_CNT_RFR_SHIFT       0x04U
/**
 * Configure the maximum value of the WD error counter
 */
#define FS45_W_FS_WD_CNT_ERR_SHIFT       0x06U

/**
 * 6
 */
#define FS45_R_FS_WD_CNT_RFR_6           (0x00U << FS45_R_FS_WD_CNT_RFR_SHIFT)
/**
 * 4
 */
#define FS45_R_FS_WD_CNT_RFR_4           (0x01U << FS45_R_FS_WD_CNT_RFR_SHIFT)
/**
 * 2
 */
#define FS45_R_FS_WD_CNT_RFR_2           (0x02U << FS45_R_FS_WD_CNT_RFR_SHIFT)
/**
 * 1
 */
#define FS45_R_FS_WD_CNT_RFR_1           (0x03U << FS45_R_FS_WD_CNT_RFR_SHIFT)

/**
 * 6
 */
#define FS45_R_FS_WD_CNT_ERR_6           (0x00U << FS45_R_FS_WD_CNT_ERR_SHIFT)
/**
 * 4
 */
#define FS45_R_FS_WD_CNT_ERR_4           (0x02U << FS45_R_FS_WD_CNT_ERR_SHIFT)
/**
 * 2
 */
#define FS45_R_FS_WD_CNT_ERR_2           (0x03U << FS45_R_FS_WD_CNT_ERR_SHIFT)

/**
 * 6
 */
#define FS45_W_FS_WD_CNT_RFR_6           (0x00U << FS45_W_FS_WD_CNT_RFR_SHIFT)
/**
 * 4
 */
#define FS45_W_FS_WD_CNT_RFR_4           (0x01U << FS45_W_FS_WD_CNT_RFR_SHIFT)
/**
 * 2
 */
#define FS45_W_FS_WD_CNT_RFR_2           (0x02U << FS45_W_FS_WD_CNT_RFR_SHIFT)
/**
 * 1
 */
#define FS45_W_FS_WD_CNT_RFR_1           (0x03U << FS45_W_FS_WD_CNT_RFR_SHIFT)

/**
 * 6
 */
#define FS45_W_FS_WD_CNT_ERR_6           (0x00U << FS45_W_FS_WD_CNT_ERR_SHIFT)
/**
 * 4
 */
#define FS45_W_FS_WD_CNT_ERR_4           (0x02U << FS45_W_FS_WD_CNT_ERR_SHIFT)
/**
 * 2
 */
#define FS45_W_FS_WD_CNT_ERR_2           (0x03U << FS45_W_FS_WD_CNT_ERR_SHIFT)

/******************************************************************************/
/* INIT_VCORE_OVUV_IMPACT - Type: RW                                          */
/******************************************************************************/

#define FS45_FS_INIT_VCORE_OVUV_IMPACT_ADDR 0x31U
#define FS45_VCORE_OVUV_IMPACT_DEFAULT 0x0EU

/**
 * VCORE_FB undervoltage safety impact
 */
#define FS45_R_FS_VCORE_FS_UV_MASK       0x03U
/**
 * VCORE_FB overvoltage safety impact
 */
#define FS45_R_FS_VCORE_FS_OV_MASK       0x0CU
/**
 * VCORE_FB undervoltage safety impact
 */
#define FS45_W_FS_VCORE_FS_UV_MASK       0x30U
/**
 * VCORE_FB overvoltage safety impact
 */
#define FS45_W_FS_VCORE_FS_OV_MASK       0xC0U

/**
 * VCORE_FB undervoltage safety impact
 */
#define FS45_R_FS_VCORE_FS_UV_SHIFT      0x00U
/**
 * VCORE_FB overvoltage safety impact
 */
#define FS45_R_FS_VCORE_FS_OV_SHIFT      0x02U
/**
 * VCORE_FB undervoltage safety impact
 */
#define FS45_W_FS_VCORE_FS_UV_SHIFT      0x04U
/**
 * VCORE_FB overvoltage safety impact
 */
#define FS45_W_FS_VCORE_FS_OV_SHIFT      0x06U

/**
 * No effect of VCORE_FB_UV on RSTB and FS0B
 */
#define FS45_R_FS_VCORE_FS_UV_NO_EFFECT  (0x00U << FS45_R_FS_VCORE_FS_UV_SHIFT)
/**
 * VCORE_FB_UV does have an impact on RSTB only
 */
#define FS45_R_FS_VCORE_FS_UV_RSTB       (0x01U << FS45_R_FS_VCORE_FS_UV_SHIFT)
/**
 * VCORE_FB_UV does have an impact on FS0B only
 */
#define FS45_R_FS_VCORE_FS_UV_FS0B       (0x02U << FS45_R_FS_VCORE_FS_UV_SHIFT)
/**
 * VCORE_FB_UV does have an impact on RSTB and FS0B
 */
#define FS45_R_FS_VCORE_FS_UV_RSTB_FS0B  (0x03U << FS45_R_FS_VCORE_FS_UV_SHIFT)

/**
 * No effect of VCORE_FB_OV on RSTB and FS0B
 */
#define FS45_R_FS_VCORE_FS_OV_NO_EFFECT  (0x00U << FS45_R_FS_VCORE_FS_OV_SHIFT)
/**
 * VCORE_FB_OV does have an impact on RSTB only
 */
#define FS45_R_FS_VCORE_FS_OV_RSTB       (0x01U << FS45_R_FS_VCORE_FS_OV_SHIFT)
/**
 * VCORE_FB_OV does have an impact on FS0B only
 */
#define FS45_R_FS_VCORE_FS_OV_FS0B       (0x02U << FS45_R_FS_VCORE_FS_OV_SHIFT)
/**
 * VCORE_FB_OV does have an impact on RSTB and FS0B
 */
#define FS45_R_FS_VCORE_FS_OV_RSTB_FS0B  (0x03U << FS45_R_FS_VCORE_FS_OV_SHIFT)

/**
 * No effect of VCORE_FB_UV on RSTB and FS0B
 */
#define FS45_W_FS_VCORE_FS_UV_NO_EFFECT  (0x00U << FS45_W_FS_VCORE_FS_UV_SHIFT)
/**
 * VCORE_FB_UV does have an impact on RSTB only
 */
#define FS45_W_FS_VCORE_FS_UV_RSTB       (0x01U << FS45_W_FS_VCORE_FS_UV_SHIFT)
/**
 * VCORE_FB_UV does have an impact on FS0B only
 */
#define FS45_W_FS_VCORE_FS_UV_FS0B       (0x02U << FS45_W_FS_VCORE_FS_UV_SHIFT)
/**
 * VCORE_FB_UV does have an impact on RSTB and FS0B
 */
#define FS45_W_FS_VCORE_FS_UV_RSTB_FS0B  (0x03U << FS45_W_FS_VCORE_FS_UV_SHIFT)

/**
 * No effect of VCORE_FB_OV on RSTB and FS0B
 */
#define FS45_W_FS_VCORE_FS_OV_NO_EFFECT  (0x00U << FS45_W_FS_VCORE_FS_OV_SHIFT)
/**
 * VCORE_FB_OV does have an impact on RSTB only
 */
#define FS45_W_FS_VCORE_FS_OV_RSTB       (0x01U << FS45_W_FS_VCORE_FS_OV_SHIFT)
/**
 * VCORE_FB_OV does have an impact on FS0B only
 */
#define FS45_W_FS_VCORE_FS_OV_FS0B       (0x02U << FS45_W_FS_VCORE_FS_OV_SHIFT)
/**
 * VCORE_FB_OV does have an impact on RSTB and FS0B
 */
#define FS45_W_FS_VCORE_FS_OV_RSTB_FS0B  (0x03U << FS45_W_FS_VCORE_FS_OV_SHIFT)

/******************************************************************************/
/* INIT_VCCA_OVUV_IMPACT - Type: RW                                           */
/******************************************************************************/

#define FS45_FS_INIT_VCCA_OVUV_IMPACT_ADDR 0x32U
#define FS45_FS_INIT_VCCA_OVUV_IMPACT_DEFAULT 0x0EU

/**
 * VCCA undervoltage safety impact
 */
#define FS45_R_FS_VCCA_FS_UV_MASK        0x03U
/**
 * VCCA overvoltage safety impact
 */
#define FS45_R_FS_VCCA_FS_OV_MASK        0x0CU
/**
 * VCCA undervoltage safety impact
 */
#define FS45_W_FS_VCCA_FS_UV_MASK        0x30U
/**
 * VCCA overvoltage safety impact
 */
#define FS45_W_FS_VCCA_FS_OV_MASK        0xC0U

/**
 * VCCA undervoltage safety impact
 */
#define FS45_R_FS_VCCA_FS_UV_SHIFT       0x00U
/**
 * VCCA overvoltage safety impact
 */
#define FS45_R_FS_VCCA_FS_OV_SHIFT       0x02U
/**
 * VCCA undervoltage safety impact
 */
#define FS45_W_FS_VCCA_FS_UV_SHIFT       0x04U
/**
 * VCCA overvoltage safety impact
 */
#define FS45_W_FS_VCCA_FS_OV_SHIFT       0x06U

/**
 * No effect of VCCA_UV on RSTB and FS0B
 */
#define FS45_R_FS_VCCA_FS_UV_NO_EFFECT   (0x00U << FS45_R_FS_VCCA_FS_UV_SHIFT)
/**
 * VCCA_UV does have an impact on RSTB only
 */
#define FS45_R_FS_VCCA_FS_UV_RSTB        (0x01U << FS45_R_FS_VCCA_FS_UV_SHIFT)
/**
 * VCCA_UV does have an impact on FS0B only
 */
#define FS45_R_FS_VCCA_FS_UV_FS0B        (0x02U << FS45_R_FS_VCCA_FS_UV_SHIFT)
/**
 * VCCA_UV does have an impact on RSTB and FS0B
 */
#define FS45_R_FS_VCCA_FS_UV_RSTB_FS0B   (0x03U << FS45_R_FS_VCCA_FS_UV_SHIFT)

/**
 * No effect of VCCA_OV on RSTB and FS0B
 */
#define FS45_R_FS_VCCA_FS_OV_NO_EFFECT   (0x00U << FS45_R_FS_VCCA_FS_OV_SHIFT)
/**
 * VCCA_OV does have an impact on RSTB only
 */
#define FS45_R_FS_VCCA_FS_OV_RSTB        (0x01U << FS45_R_FS_VCCA_FS_OV_SHIFT)
/**
 * VCCA_OV does have an impact on FS0B only
 */
#define FS45_R_FS_VCCA_FS_OV_FS0B        (0x02U << FS45_R_FS_VCCA_FS_OV_SHIFT)
/**
 * VCCA_OV does have an impact on RSTB and FS0B
 */
#define FS45_R_FS_VCCA_FS_OV_RSTB_FS0B   (0x03U << FS45_R_FS_VCCA_FS_OV_SHIFT)

/**
 * No effect of VCCA_UV on RSTB and FS0B
 */
#define FS45_W_FS_VCCA_FS_UV_NO_EFFECT   (0x00U << FS45_W_FS_VCCA_FS_UV_SHIFT)
/**
 * VCCA_UV does have an impact on RSTB only
 */
#define FS45_W_FS_VCCA_FS_UV_RSTB        (0x01U << FS45_W_FS_VCCA_FS_UV_SHIFT)
/**
 * VCCA_UV does have an impact on FS0B only
 */
#define FS45_W_FS_VCCA_FS_UV_FS0B        (0x02U << FS45_W_FS_VCCA_FS_UV_SHIFT)
/**
 * VCCA_UV does have an impact on RSTB and FS0B
 */
#define FS45_W_FS_VCCA_FS_UV_RSTB_FS0B   (0x03U << FS45_W_FS_VCCA_FS_UV_SHIFT)

/**
 * No effect of VCCA_OV on RSTB and FS0B
 */
#define FS45_W_FS_VCCA_FS_OV_NO_EFFECT   (0x00U << FS45_W_FS_VCCA_FS_OV_SHIFT)
/**
 * VCCA_OV does have an impact on RSTB only
 */
#define FS45_W_FS_VCCA_FS_OV_RSTB        (0x01U << FS45_W_FS_VCCA_FS_OV_SHIFT)
/**
 * VCCA_OV does have an impact on FS0B only
 */
#define FS45_W_FS_VCCA_FS_OV_FS0B        (0x02U << FS45_W_FS_VCCA_FS_OV_SHIFT)
/**
 * VCCA_OV does have an impact on RSTB and FS0B
 */
#define FS45_W_FS_VCCA_FS_OV_RSTB_FS0B   (0x03U << FS45_W_FS_VCCA_FS_OV_SHIFT)

/******************************************************************************/
/* INIT_VAUX_OVUV_IMPACT - Type: RW                                           */
/******************************************************************************/

