OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_fs45/include/sbc_fs45_map.h
#define FS45_FS_INIT_VAUX_OVUV_IMPACT_ADDR 0x33U
#define FS45_FS_INIT_VAUX_OVUV_IMPACT_DEFAULT 0x0EU

/**
 * VAUX undervoltage safety impact
 */
#define FS45_R_FS_VAUX_FS_UV_MASK        0x03U
/**
 * VAUX overvoltage safety impact
 */
#define FS45_R_FS_VAUX_FS_OV_MASK        0x0CU
/**
 * VAUX undervoltage safety impact
 */
#define FS45_W_FS_VAUX_FS_UV_MASK        0x30U
/**
 * VAUX overvoltage safety impact
 */
#define FS45_W_FS_VAUX_FS_OV_MASK        0xC0U

/**
 * VAUX undervoltage safety impact
 */
#define FS45_R_FS_VAUX_FS_UV_SHIFT       0x00U
/**
 * VAUX overvoltage safety impact
 */
#define FS45_R_FS_VAUX_FS_OV_SHIFT       0x02U
/**
 * VAUX undervoltage safety impact
 */
#define FS45_W_FS_VAUX_FS_UV_SHIFT       0x04U
/**
 * VAUX overvoltage safety impact
 */
#define FS45_W_FS_VAUX_FS_OV_SHIFT       0x06U

/**
 * No effect of VAUX_UV on RSTB and FS0B
 */
#define FS45_R_FS_VAUX_FS_UV_NO_EFFECT   (0x00U << FS45_R_FS_VAUX_FS_UV_SHIFT)
/**
 * VAUX_UV does have an impact on RSTB only
 */
#define FS45_R_FS_VAUX_FS_UV_RSTB        (0x01U << FS45_R_FS_VAUX_FS_UV_SHIFT)
/**
 * VAUX_UV does have an impact on FS0B only
 */
#define FS45_R_FS_VAUX_FS_UV_FS0B        (0x02U << FS45_R_FS_VAUX_FS_UV_SHIFT)
/**
 * VAUX_UV does have an impact on RSTB and FS0B
 */
#define FS45_R_FS_VAUX_FS_UV_RSTB_FS0B   (0x03U << FS45_R_FS_VAUX_FS_UV_SHIFT)

/**
 * No effect of VAUX_OV on RSTB and FS0B
 */
#define FS45_R_FS_VAUX_FS_OV_NO_EFFECT   (0x00U << FS45_R_FS_VAUX_FS_OV_SHIFT)
/**
 * VAUX_OV does have an impact on RSTB only
 */
#define FS45_R_FS_VAUX_FS_OV_RSTB        (0x01U << FS45_R_FS_VAUX_FS_OV_SHIFT)
/**
 * VAUX_OV does have an impact on FS0B only
 */
#define FS45_R_FS_VAUX_FS_OV_FS0B        (0x02U << FS45_R_FS_VAUX_FS_OV_SHIFT)
/**
 * VAUX_OV does have an impact on RSTB and FS0B
 */
#define FS45_R_FS_VAUX_FS_OV_RSTB_FS0B   (0x03U << FS45_R_FS_VAUX_FS_OV_SHIFT)

/**
 * No effect of VAUX_UV on RSTB and FS0B
 */
#define FS45_W_FS_VAUX_FS_UV_NO_EFFECT   (0x00U << FS45_W_FS_VAUX_FS_UV_SHIFT)
/**
 * VAUX_UV does have an impact on RSTB only
 */
#define FS45_W_FS_VAUX_FS_UV_RSTB        (0x01U << FS45_W_FS_VAUX_FS_UV_SHIFT)
/**
 * VAUX_UV does have an impact on FS0B only
 */
#define FS45_W_FS_VAUX_FS_UV_FS0B        (0x02U << FS45_W_FS_VAUX_FS_UV_SHIFT)
/**
 * VAUX_UV does have an impact on RSTB and FS0B
 */
#define FS45_W_FS_VAUX_FS_UV_RSTB_FS0B   (0x03U << FS45_W_FS_VAUX_FS_UV_SHIFT)

/**
 * No effect of VAUX_OV on RSTB and FS0B
 */
#define FS45_W_FS_VAUX_FS_OV_NO_EFFECT   (0x00U << FS45_W_FS_VAUX_FS_OV_SHIFT)
/**
 * VAUX_OV does have an impact on RSTB only
 */
#define FS45_W_FS_VAUX_FS_OV_RSTB        (0x01U << FS45_W_FS_VAUX_FS_OV_SHIFT)
/**
 * VAUX_OV does have an impact on FS0B only
 */
#define FS45_W_FS_VAUX_FS_OV_FS0B        (0x02U << FS45_W_FS_VAUX_FS_OV_SHIFT)
/**
 * VAUX_OV does have an impact on RSTB and FS0B
 */
#define FS45_W_FS_VAUX_FS_OV_RSTB_FS0B   (0x03U << FS45_W_FS_VAUX_FS_OV_SHIFT)

/******************************************************************************/
/* INIT_INT - Type: RW                                                        */
/******************************************************************************/

#define FS45_M_INIT_INT_ADDR             0x04U
#define FS45_M_INIT_INT_DEFAULT          0x00U

/**
 * Inhibit the interrupt for CAN error bits
 */
#define FS45_RW_M_INT_INH_CAN_MASK       0x01U
/**
 * Inhibit the interrupt for VCCA/VAUX and VCAN status event
 */
#define FS45_RW_M_INT_INH_VOTHER_MASK    0x02U
/**
 * Inhibit the interrupt for VCORE status event
 */
#define FS45_RW_M_INT_INH_VCORE_MASK     0x04U
/**
 * Inhibit the interrupt for VPRE status event
 */
#define FS45_RW_M_INT_INH_VPRE_MASK      0x08U
/**
 * Inhibit the interrupt for VSNS_UV
 */
#define FS45_RW_M_INT_INH_VSNS_MASK      0x10U
/**
 * Inhibit ALL the interrupt
 */
#define FS45_RW_M_INT_INH_ALL_MASK       0x20U
/**
 * Inhibit the interrupt for LIN error bits
 */
#define FS45_RW_M_INT_INH_LIN_MASK       0x40U
/**
 * Define the duration of the interrupt pulse
 */
#define FS45_RW_M_NT_DURATION_MASK       0x80U

/**
 * Inhibit the interrupt for CAN error bits
 */
#define FS45_RW_M_INT_INH_CAN_SHIFT      0x00U
/**
 * Inhibit the interrupt for VCCA/VAUX and VCAN status event
 */
#define FS45_RW_M_INT_INH_VOTHER_SHIFT   0x01U
/**
 * Inhibit the interrupt for VCORE status event
 */
#define FS45_RW_M_INT_INH_VCORE_SHIFT    0x02U
/**
 * Inhibit the interrupt for VPRE status event
 */
#define FS45_RW_M_INT_INH_VPRE_SHIFT     0x03U
/**
 * Inhibit the interrupt for VSNS_UV
 */
#define FS45_RW_M_INT_INH_VSNS_SHIFT     0x04U
/**
 * Inhibit ALL the interrupt
 */
#define FS45_RW_M_INT_INH_ALL_SHIFT      0x05U
/**
 * Inhibit the interrupt for LIN error bits
 */
#define FS45_RW_M_INT_INH_LIN_SHIFT      0x06U
/**
 * Define the duration of the interrupt pulse
 */
#define FS45_RW_M_NT_DURATION_SHIFT      0x07U

/**
 * All INT sources
 */
#define FS45_RW_M_INT_INH_CAN_ALL_SOURCES (0x00U << FS45_RW_M_INT_INH_CAN_SHIFT)
/**
 * CAN error bits change inhibited
 */
#define FS45_RW_M_INT_INH_CAN_CAN_INHIBITED (0x01U << FS45_RW_M_INT_INH_CAN_SHIFT)

/**
 * All INT sources
 */
#define FS45_RW_M_INT_INH_VOTHER_ALL_SOURCES (0x00U << FS45_RW_M_INT_INH_VOTHER_SHIFT)
/**
 * VCCA/VAUX/VCAN status change inhibited
 */
#define FS45_RW_M_INT_INH_VOTHER_VOTHER_INHIBITED (0x01U << FS45_RW_M_INT_INH_VOTHER_SHIFT)

/**
 * All INT sources
 */
#define FS45_RW_M_INT_INH_VCORE_ALL_SOURCES (0x00U << FS45_RW_M_INT_INH_VCORE_SHIFT)
/**
 * VCORE status change inhibited
 */
#define FS45_RW_M_INT_INH_VCORE_VCORE_INHIBITED (0x01U << FS45_RW_M_INT_INH_VCORE_SHIFT)

/**
 * All INT sources
 */
#define FS45_RW_M_INT_INH_VPRE_ALL_SOURCES (0x00U << FS45_RW_M_INT_INH_VPRE_SHIFT)
/**
 * VPRE status change inhibited
 */
#define FS45_RW_M_INT_INH_VPRE_VPRE_INHIBITED (0x01U << FS45_RW_M_INT_INH_VPRE_SHIFT)

/**
 * All INT sources
 */
#define FS45_RW_M_INT_INH_VSNS_ALL_SOURCES (0x00U << FS45_RW_M_INT_INH_VSNS_SHIFT)
/**
 * VSNS_UV INT inhibited
 */
#define FS45_RW_M_INT_INH_VSNS_VSNS_UV_INHIBITED (0x01U << FS45_RW_M_INT_INH_VSNS_SHIFT)

/**
 * All INT sources
 */
#define FS45_RW_M_INT_INH_ALL_ALL_SOURCES (0x00U << FS45_RW_M_INT_INH_ALL_SHIFT)
/**
 * All INT inhibited
 */
#define FS45_RW_M_INT_INH_ALL_ALL_INHIBITED (0x01U << FS45_RW_M_INT_INH_ALL_SHIFT)

/**
 * All INT sources
 */
#define FS45_RW_M_INT_INH_LIN_ALL_SOURCES (0x00U << FS45_RW_M_INT_INH_LIN_SHIFT)
/**
 * LIN error bits change INHIBITED
 */
#define FS45_RW_M_INT_INH_LIN_LIN_INHIBITED (0x01U << FS45_RW_M_INT_INH_LIN_SHIFT)

/**
 * 100 us
 */
#define FS45_RW_M_NT_DURATION_100US      (0x00U << FS45_RW_M_NT_DURATION_SHIFT)
/**
 * 25 us
 */
#define FS45_RW_M_NT_DURATION_25US       (0x01U << FS45_RW_M_NT_DURATION_SHIFT)


#endif /* SBC_FS45_MAP_H__ */
